[
    {
        "idMeal": 1,
        "price": 320,
        "rating":5,
        "strMeal": "Baked salmon with fennel & tomatoes",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "British",
        "strInstructions": "Heat oven to 180C/fan 160C/gas 4. Trim the fronds from the fennel and set aside. Cut the fennel bulbs in half, then cut each half into 3 wedges. Cook in boiling salted water for 10 mins, then drain well. Chop the fennel fronds roughly, then mix with the parsley and lemon zest.\r\n\r\nSpread the drained fennel over a shallow ovenproof dish, then add the tomatoes.Drizzle with olive oil, then bake for 10 mins. Nestle the salmon among the veg, sprinkle with lemon juice, then bake 15 mins more until the fish is just cooked. Scatter over the parsley and serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1548772327.jpg",
        "strTags": "Paleo,Keto,HighFat,Baking,LowCarbs",
        "strYoutube": "https://www.youtube.com/watch?v=xvPR2Tfw5k0",
        "strIngredient1": [
            "Fennel",
            "Parsley",
            "Lemon",
            "Cherry Tomatoes",
            "live Oil",
            "Salmon",
            "Black Olives"
        ]
    },
    {
        "idMeal": 2,
        "price": 140,
        "rating":3.9,
        "strMeal": "Cajun spiced fish tacos",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Mexican",
        "strInstructions": "Cooking in a cajun spice and cayenne pepper marinade makes this fish super succulent and flavoursome. Top with a zesty dressing and serve in a tortilla for a quick, fuss-free main that's delightfully summery.\r\n\r\nOn a large plate, mix the cajun spice and cayenne pepper with a little seasoning and use to coat the fish all over.\r\n\r\nHeat a little oil in a frying pan, add in the fish and cook over a medium heat until golden. Reduce the heat and continue frying until the fish is cooked through, about 10 minutes. Cook in batches if you don’t have enough room in the pan.\r\n\r\nMeanwhile, prepare the dressing by combining all the ingredients with a little seasoning.\r\nSoften the tortillas by heating in the microwave for 5-10 seconds. Pile high with the avocado, lettuce and spring onion, add a spoonful of salsa, top with large flakes of fish and drizzle over the dressing.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/uvuyxu1503067369.jpg",
        "strTags": "Spicy,Fish",
        "strYoutube": "https://www.youtube.com/watch?v=N4EdUt0Ou48",
        "strIngredient": [
            "cajun",
            "cayenne pepper",
            "vegetable oil",
            "white fish",
            "flour tortilla",
            "avocado",
            "little gem lettuce",
            "salsa",
            "sour cream",
            "garlic"
        ]
       
    },
    {
        "idMeal": 3,
        "price": 200,   
        "rating":4.5,
        "strMeal": "Escovitch Fish",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Jamaican",
        "strInstructions": "Rinse fish; rub with lemon or lime, seasoned with salt and pepper or use your favorite seasoning. I used creole seasoning. Set aside or place in the oven to keep it warm until sauce is ready.\r\n\r\nIn large skillet heat oil over medium heat, until hot, add the fish, cook each side- for about 5-7 minutes until cooked through and crispy on both sides. Remove fish and set aside. Drain oil and leave about 2-3 tablespoons of oil\r\nAdd, bay leave, garlic and ginger, stir-fry for about a minute making sure the garlic does not burn\r\nThen add onion, bell peppers, thyme, scotch bonnet, sugar, all spice-continue stirring for about 2-3 minutes. Add vinegar, mix an adjust salt and pepper according to preference. Let it simmer for about 2 more minutes. \r\n\r\nDiscard bay leave, thyme spring and serve over fish with a side of this bammy. You may make the sauce about 2 days in advance.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1520084413.jpg",
        "strTags": "Seafood,Spicy,Speciality,Easter",
        "strYoutube": "https://www.youtube.com/watch?v=nF6DOtGE6k8",
        "strIngredient": [
            "Red Snapper",
            "Vegetable Oil",
            "Garlic",
            "Ginger",
            "Thyme",
            "Bay Leaf",
            "Red Pepper",
            "Yellow Pepper",
            "Onion",
            "Carrots",
            "Sugar",
            "Allspice",
            "Worcestershire Sauce",
            "Scotch Bonnet",
            "Lime",
            "Malt Vinegar",
            "Pepper"
        ]
    },
    {
        "idMeal": 4,
        "price": 100,   
        "rating":3.5,
        "strMeal": "Fish fofos",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Portuguese",
        "strInstructions": "STEP 1\r\n\r\nPut the fish into a lidded pan and pour over enough water to cover. Bring to a simmer and gently poach for 10 minutes over a low heat with the lid on. Drain and flake the fish.\r\n\r\nSTEP 2\r\n\r\nPut the fish, potato, green chilli, coriander, cumin, black pepper, garlic and ginger in a large bowl. Season, add the rice flour, mix well and break in 1 egg. Stir the mixture and divide into 15, then form into small logs. Break the remaining eggs into a bowl and whisk lightly. Put the breadcrumbs into another bowl. Dip each fofo in the beaten egg followed by the breadcrumb mixture. Chill for 20 minutes.\r\n\r\nSTEP 3\r\n\r\nHeat 1cm of oil in a large frying pan over a medium heat. Fry the fofos in batches for 2 minutes on each side, turning gently to get an even golden brown colour all over. Drain on kitchen paper and repeat with the remaining fofos.\r\n\r\nSTEP 4\r\n\r\nFor the onion salad, mix together the onion, coriander and lemon juice with a pinch of salt. Serve with the fofos and mango chutney.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/a15wsa1614349126.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=YXUZHK2PrV8",
        "strIngredient": [
            "Haddock",
            "Potatoes",
            "Green Chilli",
            "Coriander",
            "Cumin Seeds",
            "Pepper",
            "Garlic",
            "Ginger",
            "Flour",
            "Eggs",
            "Breadcrumbs",
            "Vegetable Oil"
        ]
    },
    {
        "idMeal": 5,
        "price":200,
        "rating":5,
        "strMeal": "Fish pie",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "British",
        "strInstructions": "01.Put the potatoes in a large pan of cold salted water and bring to the boil. Lower the heat, cover, then simmer gently for 15 minutes until tender. Drain, then return to the pan over a low heat for 30 seconds to drive off any excess water. Mash with 1 tbsp olive oil, then season.\r\n02.Meanwhile put the milk in a large sauté pan, add the fish and bring to the boil. Remove from the heat, cover and stand for 3 minutes. Remove the fish (reserving the milk) and pat dry with kitchen paper, then gently flake into an ovenproof dish, discarding the skin and any bones.\r\n03.Heat the remaining oil in a pan, stir in the flour and cook for 30 seconds. Gradually stir in 200-250ml of the reserved milk (discard the rest). Grate in nutmeg, season, then bubble until thick. Stir in the cream.\r\n04.Preheat the oven to 190°C/fan170°C/gas 5. Grate the artichokes and add to the dish with the leek, prawns and herbs. Stir the lemon zest and juice into the sauce, then pour over. Mix gently with a wooden spoon.\r\n05.Spoon the mash onto the fish mixture, then use a fork to make peaks, which will crisp and brown as it cooks. Sprinkle over the cheese, then bake for 35-40 minutes until golden and bubbling. Serve with wilted greens.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
        "strTags": "Fish,Pie,Breakfast,Baking",
        "strYoutube": "https://www.youtube.com/watch?v=2sX4fCgg-UI",
        "strIngredient": [
            "Floury Potatoes",
            "Olive Oil",
            "Semi-skimmed Milk",
            "White Fish Fillets",
            "Plain flour",
            "Nutmeg",
            "Double Cream",
            "Jerusalem Artichokes",
            "Leek",
            "Prawns",
            "Parsley",
            "Dill",
            "Lemon",
            "Gruyère",
            "Lemon"
        ]
    },
    {
        "idMeal": 6,
        "price":310,
        "rating":5,
        "strMeal": "Fish Stew with Rouille",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "French",
        "strInstructions": "Twist the heads from the prawns, then peel away the legs and shells, but leave the tails intact. Devein each prawn. Fry the shells in 1 tbsp oil for 5 mins, until dark pink and golden in patches. Add the wine, boil down by two thirds, then pour in the stock. Strain into a jug, discarding the shells.\r\nHeat the rest of the oil in a deep frying pan or casserole. Add the fennel, onion and garlic, season, then cover and gently cook for 10 mins until softened. Meanwhile, peel the potato and cut into 2cm-ish chunks. Put into a pan of cold water, bring to the boil and cook for 5 mins until almost tender. Drain in a colander.\r\nPeel a strip of zest from the orange. Put the zest, star anise, bay and ½ tsp harissa into the pan. Fry gently, uncovered, for 5-10 mins, until the vegetables are soft, sweet and golden.\r\nStir in the tomato purée, cook for 2 mins, then add the tomatoes and stock. Simmer for 10 mins until the sauce thickens slightly. Season to taste. The sauce can be made ahead, then reheated later in the day. Meantime, scrub the mussels or clams and pull away any stringy beards. Any that are open should be tapped sharply on the worktop – if they don’t close after a few seconds, discard them.\r\nReheat the sauce if necessary, then stir the potato, chunks of fish and prawns very gently into the stew. Bring back to the boil, then cover and gently simmer for 3 mins. Scatter the mussels or clams over the stew, then cover and cook for 2 mins more or until the shells have opened wide. Discard any that remain closed. The chunks of fish should flake easily and the prawns should be pink through. Scatter with the thyme leaves.\r\nTo make the quick rouille, stir the rest of the harissa through the mayonnaise. Serve the stew in bowls, topped with spoonfuls of rouille, which will melt into the sauce and enrich it. Have some good bread ready, as you’ll definitely want to mop up the juices.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/vptqpw1511798500.jpg",
        "strTags": "Fish,Seafood,Shellfish",
        "strYoutube": "https://www.youtube.com/watch?v=fp9Lqx2EUco",
        "strIngredient": [
            "Prawns",
            "Olive Oil",
            "Dry White Wine",
            "Fish Stock",
            "Fennel",
            "Onion",
            "Garlic",
            "Potatoes",
            "Orange",
            "Star Anise",
            "Bay Leaf",
            "Harissa Spice",
            "Chopped Tomatoes",
            "Mussels",
            "White Fish",
            "Thyme",
            "Bread"
        ]
    },
    {
        "idMeal": 7,
        "price":20,
        "rating":4.5,
        "strMeal": "Garides Saganaki",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Greek",
        "strInstructions": "Place the prawns in a pot and add enough water to cover. Boil for 5 minutes. Drain, reserving the liquid, and set aside.\r\nHeat 2 tablespoons of oil in a saucepan. Add the onion; cook and stir until soft. Mix in the parsley, wine, tomatoes, garlic and remaining olive oil. Simmer, stirring occasionally, for about 30 minutes, or until the sauce is thickened.\r\nWhile the sauce is simmering, the prawns should become cool enough to handle. First remove the legs by pinching them, and then pull off the shells, leaving the head and tail on.\r\nWhen the sauce has thickened, stir in the prawns. Bring to a simmer again if the sauce has cooled with the prawns, and cook for about 5 minutes. Add the feta and remove from the heat. Let stand until the cheese starts to melt. Serve warm with slices of crusty bread.\r\nThough completely untraditional, you can add a few tablespoons of stock or passata to this recipe to make a delicious pasta sauce. Toss with pasta after adding the feta, and serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wuvryu1468232995.jpg",
        "strTags": "Seafood,Shellfish",
        "strYoutube": "https://www.youtube.com/watch?v=uO0ejc85zSE",
        "strIngredient": [
            "Raw king prawns",
            "Olive oil",
            "Chopped onion",
            "Freshly chopped parsley",
            "White wine",
            "Chopped tomatoes",
            "Minced garlic",
            "Cubed Feta cheese"
        ]
    },
    {
        "idMeal": 8,
        "price":210,
        "rating":3.5,
        "strMeal": "Grilled Portuguese sardines",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Portuguese",
        "strInstructions": "STEP 1\r\n\r\nPut all of the ingredients, except the sardines, into a bowl and mix together with some seasoning. Pour into a baking dish, add the sardines and toss really well. Cover and chill for a few hours.\r\n\r\nSTEP 2\r\n\r\nHeat a BBQ or griddle pan until hot. Cook the sardines for 4-5 minutes on each side or until really caramelised and charred. Put onto a serving plate, drizzle with oil, sprinkle with a little more paprika and squeeze over the lemon wedges.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/lpd4wy1614347943.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=JYtMjKa6cdY",
        "strIngredient": [
            "Sardines",
            "Olive Oil",
            "Garlic",
            "Paprika",
            "Lemon",
            "Rosemary",
            "Red Chilli"
        ]
    },
    {
        "idMeal": 9,
        "price":49,
        "rating":5,
        "strMeal": "Honey Teriyaki Salmon",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Japanese",
        "strInstructions": "Mix all the ingredients in the Honey Teriyaki Glaze together. Whisk to blend well. Combine the salmon and the Glaze together.\r\n\r\nHeat up a skillet on medium-low heat. Add the oil, Pan-fry the salmon on both sides until it’s completely cooked inside and the glaze thickens.\r\n\r\nGarnish with sesame and serve immediately.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xxyupu1468262513.jpg",
        "strTags": "Fish,Breakfast,DateNight",
        "strYoutube": "https://www.youtube.com/watch?v=4MpYuaJsvRw",
        "strIngredient": [
            "Salmon",
            "Olive oil",
            "Soy Sauce",
            "Sake",
            "Sesame Seed"
        ]
    },
    {
        "idMeal": 10,
        "price":70,
        "rating":2.5,
        "strMeal": "Kedgeree",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "British",
        "strInstructions": "For the rice, heat the oil in a large, lidded pan, add the onion, then gently fry for 5 mins until softened but not coloured. Add the spices, season with salt, then continue to fry until the mix start to go brown and fragrant; about 3 mins.\r\nAdd the rice and stir in well. Add 600ml water, stir, then bring to the boil. Reduce to a simmer, then cover for 10 mins. Take off the heat and leave to stand, covered, for 10-15 mins more. The rice will be perfectly cooked if you do not lift the lid before the end of the cooking.\r\nMeanwhile, put the haddock and bay leaves in a frying pan, cover with the milk, then poach for 10 mins until the flesh flakes. Remove from the milk, peel away the skin, then flake the flesh into thumbsize pieces. Place the eggs in a pan, cover with water, bring to the boil, then reduce to a simmer. Leave for 4½-5 mins, plunge into cold water, then peel and cut the eggs into quarters. Gently mix the fish, eggs, parsley, coriander and rice together in the pan. Serve hot, sprinkled with a few extra herbs.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/utxqpt1511639216.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=_Pw1I1-SItE",
        "strIngredient": [
            "Smoked Haddock",
            "Bay Leaves",
            "Milk",
            "Eggs",
            "Parsley",
            "Coriander",
            "Vegetable Oil",
            "Onion",
            "Coriander",
            "Curry Powder",
            "Rice"
        ]
    },
    {
        "idMeal": 11,
        "price":210,
        "rating":5,
        "strMeal": "Kung Po Prawns",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Chinese",
        "strInstructions": "Mix the cornflour and 1 tbsp soy sauce, toss in the prawns and set aside for 10 mins. Stir the vinegar, remaining soy sauce, tomato purée, sugar and 2 tbsp water together to make a sauce.\r\n\r\nWhen you’re ready to cook, heat a large frying pan or wok until very hot, then add 1 tbsp oil. Fry the prawns until they are golden in places and have opened out– then tip them out of the pan.\r\n\r\nHeat the remaining oil and add the peanuts, chillies and water chestnuts. Stir-fry for 2 mins or until the peanuts start to colour, then add the ginger and garlic and fry for 1 more min. Tip in the prawns and sauce and simmer for 2 mins until thickened slightly. Serve with rice.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1525873040.jpg",
        "strTags": "BBQ",
        "strYoutube": "https://www.youtube.com/watch?v=ysiuZm9FIxs",
        "strIngredient": [
            "Prawns",
            "Soy Sauce",
            "Tomato Puree",
            "Corn Flour",
            "Caster Sugar",
            "Sunflower Oil",
            "Peanuts",
            "Chilli",
            "Brown Sugar",
            "Garlic Clove",
            "Water Chestnut",
            "Ginger"
        ]
    },
    {
        "idMeal": 12,
        "price":240,
        "rating":5,
        "strMeal": "Laksa King Prawn Noodles",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Malaysian",
        "strInstructions": "Heat the oil in a medium saucepan and add the chilli. Cook for 1 min, then add the curry paste, stir and cook for 1 min more. Dissolve the stock cube in a large jug in 700ml boiling water, then pour into the pan and stir to combine. Tip in the coconut milk and bring to the boil.\r\nAdd the fish sauce and a little seasoning. Toss in the noodles and cook for a further 3-4 mins until softening. Squeeze in the lime juice, add the prawns and cook through until warm, about 2-3 mins. Scatter over some of the coriander.\r\nServe in bowls with the remaining coriander and lime wedges on top for squeezing over.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/rvypwy1503069308.jpg",
        "strTags": "Shellfish,Seafood",
        "strYoutube": "https://www.youtube.com/watch?v=OcarztU8cYo",
        "strIngredient": [
            "Olive Oil",
            "red chili",
            "Thai red curry paste",
            "vegetable stock cube",
            "coconut milk",
            "fish sauce",
            "rice noodles",
            "lime",
            "king prawns",
            "coriander"
        ]
    },
    {
        "idMeal": 13,
        "price":110,
        "rating":4.5,
        "strMeal": "Mediterranean Pasta Salad",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Italian",
        "strInstructions": "Bring a large saucepan of salted water to the boil\r\nAdd the pasta, stir once and cook for about 10 minutes or as directed on the packet.\r\nMeanwhile, wash the tomatoes and cut into quarters. Slice the olives. Wash the basil.\r\nPut the tomatoes into a salad bowl and tear the basil leaves over them. Add a tablespoon of olive oil and mix.\r\nWhen the pasta is ready, drain into a colander and run cold water over it to cool it quickly.\r\nToss the pasta into the salad bowl with the tomatoes and basil.\r\nAdd the sliced olives, drained mozzarella balls, and chunks of tuna. Mix well and let the salad rest for at least half an hour to allow the flavours to mingle.\r\nSprinkle the pasta with a generous grind of black pepper and drizzle with the remaining olive oil just before serving.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wvqpwt1468339226.jpg",
        "strTags": "Pasta,Baking",
        "strYoutube": "https://www.youtube.com/watch?v=e52IL8zYmaE",
        "strIngredient1": [
            "mozzarella balls",
            "baby plum tomatoes",
            "fresh basil",
            "farfalle",
            "extra virgin olive oil",
            "Green Olives",
            "tuna",
            "salt",
            "pepper"
        ]
    },
    {
        "idMeal": 14,
        "price":210,
        "rating":3.5,
        "strMeal": "Mee goreng mamak",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Malaysian",
        "strInstructions": "Heat oil in a pan at medium heat. Then, add peanuts, dried chilies, dried shrimps and dhal. Fry the aromatics until fragrant. Remove from pan and leave aside.\r\n\r\nBlend fried ingredients with tamarind paste and water until fine. Then, sauté the blended ingredients in oil heated over low heat. Continue cooking until the oil separates from the paste and turns a darker shade.\r\n\r\nSkin and cut potatoes into small chunks and boil them in a pot of water until knife-tender. Once ready, remove them from the pot and leave aside. Discard water.\r\n\r\nSlice onion and fried tofu, mince garlic, cut some cabbage and Chinese flowering cabbage (choi sam). Prepare prawn fritters and cut them. Boil noodles to soften them if bought dried. Also mix black soy sauce with water.\r\n\r\nTo fry one portion of mee goreng mamak, heat oil and add 1/4 of the following ingredients in this order: garlic, onion, paste. Sauté until fragrant. Optionally, add prawns.\r\n\r\nAdd in 1/4 amount of tofu, boiled potatoes, cabbage, Chinese flowering cabbage and prawn fritters. Sauté for another 30 seconds.\r\n\r\nAdd noodles to the wok. Add 3 tablespoons of dark soy sauce mixture. Mix evenly for the next 1 minute. Then, move the noodles to the side of the wok. Stir in an egg. Garnish with a slice of lime and slices of green chilies. To cook another plate of noodles, repeat from step 5 onwards.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xquakq1619787532.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=pOJEmDBgtSk",
        "strIngredient": [
            "Peanuts",
            "Chilli",
            "Prawns",
            "Oil",
            "Water",
            "Tamarind Paste",
            "Potatoes",
            "Red Onions",
            "Garlic Clove",
            "Cabbage",
            "Chinese Broccoli",
            "Tofu",
            "Soy Sauce",
            "Noodles",
            "Egg"
        ]
    },
    {
        "idMeal": 15,
        "price":310,
        "rating":3.5,
        "strMeal": "Nasi lemak",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Malaysian",
        "strInstructions": "In a medium saucepan over medium heat, stir together coconut milk, water, ground ginger, ginger root, salt, bay leaf, and rice. Cover, and bring to a boil. Reduce heat, and simmer for 20 to 30 minutes, or until done.\r\n\r\n Step 2\r\nPlace eggs in a saucepan, and cover with cold water. Bring water to a boil, and immediately remove from heat. Cover, and let eggs stand in hot water for 10 to 12 minutes. Remove eggs from hot water, cool, peel and slice in half. Slice cucumber.\r\n\r\n Step 3\r\nMeanwhile, in a large skillet or wok, heat 1 cup vegetable oil over medium-high heat. Stir in peanuts and cook briefly, until lightly browned. Remove peanuts with a slotted spoon and place on paper towels to soak up excess grease. Return skillet to stove. Stir in the contents of one package anchovies; cook briefly, turning, until crisp. Remove with a slotted spoon and place on paper towels. Discard oil. Wipe out skillet.\r\n\r\n Step 4\r\nHeat 2 tablespoons oil in the skillet. Stir in the onion, garlic, and shallots; cook until fragrant, about 1 or 2 minutes. Mix in the chile paste, and cook for 10 minutes, stirring occasionally. If the chile paste is too dry, add a small amount of water. Stir in remaining anchovies; cook for 5 minutes. Stir in salt, sugar, and tamarind juice; simmer until sauce is thick, about 5 minutes.\r\n\r\n Step 5\r\nServe the onion and garlic sauce over the warm rice, and top with peanuts, fried anchovies, cucumbers, and eggs.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wai9bw1619788844.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=IUIs4C86Ilo",
        "strIngredient": [
            "Coconut Milk",
            "Ginger Paste",
            "Ginger",
            "Bay Leaf",
            "Rice",
            "Eggs",
            "Cucumber",
            "Peanuts",
            "Anchovy Fillet",
            "Vegetable Oil",
            "Onion",
            "Garlic",
            "Shallots",
            "Chilli Powder",
            "Anchovy Fillet",
            "Sugar",
            "Tamarind Paste"
        ]
    },
    {
        "idMeal": 16,
        "price":69,
        "rating":4.9,
        "strMeal": "Portuguese fish stew (Caldeirada de peixe)",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Portuguese",
        "strInstructions": "STEP 1\r\n\r\nHeat a drizzle of oil in a large, deep-sided frying pan, and fry the onion and pepper on a medium heat until softened but not browned. Finely chop the coriander stalks (keep the leaves for later), and add to the pan with the chilli and chopped garlic. Fry for another few minutes. Add the wine, saffron and bay leaf and let it simmer until reduced by half.\r\n\r\nSTEP 2\r\n\r\nAdd the potatoes, tomatoes, and 300ml water and bring to a gentle boil. Break up the tomatoes with a spoon on the side of the pan and simmer for 20-25 minutes until the potatoes are just tender, and the tomatoes have broken down.\r\n\r\nSTEP 3\r\n\r\nSeason well, then gently push the fish into the sauce, and arrange the squid, prawns, clams and mussels on the surface. Put the lid on and cook for 6-8 minutes until the mussel and clam shells have opened, the prawns are cooked and the fish is flaky. Toast the bread, rub lightly with the halved garlic clove and drizzle with olive oil. Serve the stew scatted with chopped coriander leaves, and the toasts for dunking.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/do7zps1614349775.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=utv-GpSJypk",
        "strIngredient": [
            "Onions",
            "Red Pepper",
            "Coriander",
            "Red Chilli",
            "Garlic",
            "Dry White Wine",
            "Saffron",
            "Bay Leaf",
            "Potatoes",
            "Plum Tomatoes",
            "Cod",
            "Squid",
            "Tiger Prawns",
            "Clams",
            "Mussels",
            "Baguette"
        ]
    },
    {
        "idMeal": 17,
        "price":69,
        "rating":4.9,
        "strMeal": "Recheado Masala Fish",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Indian",
        "strInstructions": "Soak all the spices, ginger, garlic, tamarind pulp and kashmiri chilies except oil in vinegar.\r\nAdd sugar and salt.\r\nAlso add turmeric powder.\r\nCombine all nicely and marinate for 35-40 mins.\r\nGrind the mixture until soft and smooth. Add more vinegar if required but ensure the paste has to be thick so add vinegar accordingly. If the masala paste is thin then it would not stick to the fish.\r\nRinse the fish slit from the center and give some incision from the top. You could see the fish below for clarity.\r\nNow stuff the paste into the center and into the incision. Coat the entire fish with this paste. Marinate the fish for 30 mins.\r\nPlace oil in a shallow pan, once oil is quite hot shallow fry the stuffed mackerels.\r\nFry until golden brown from both sides\r\nServe the recheado mackerels hot with salad, lime wedges, rice and curry.\r\nNotes\r\n1. Ensure the masala paste is thick else the result won't be good.\r\n2. If you aren't able to find kashmiri chilies then use bedgi chilies or kashmiri red chili powder.\r\n3. You could use white vinegar or coconut vinegar.\r\n4. Any left over paste could be stored in the fridge for future use.\r\n5. Cinnamon could be avoided as it's a strong spice used generally for meat or chicken.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/uwxusv1487344500.jpg",
        "strTags": "Fish,Spicy",
        "strYoutube": "https://www.youtube.com/watch?v=FXtCris37nE",
        "strIngredient": [
            "Mackerel",
            "Red Chili",
            "Ginger",
            "Garlic",
            "Pepper",
            "Cumin",
            "Turmeric",
            "Cinnamon stick",
            "Clove",
            "Cardamom",
            "Sugar",
            "Tamarind ball",
            "Vinegar",
            "Oil"
        ]
    },
    {
        "idMeal": 18,
        "price":146,
        "rating":2.6,
        "strMeal": "Salmon Avocado Salad",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "British",
        "strInstructions": "Season the salmon, then rub with oil. Mix the dressing ingredients together. Halve, stone, peel and slice the avocados. Halve and quarter the cucumber lengthways, then cut into slices. Divide salad, avocado and cucumber between four plates, then drizzle with half the dressing.\r\n\r\nHeat a non-stick pan. Add the salmon and fry for 3-4 mins on each side until crisp but still moist inside. Put a salmon fillet on top of each salad and drizzle over the remaining dressing. Serve warm.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1549542994.jpg",
        "strTags": "Paleo,Keto,LowCarbs,Salad,Alcoholic,Halloween,",
        "strYoutube": "https://www.youtube.com/watch?v=FJiu2S0Xap0",
        "strIngredient": [
            "Salmon",
            "Avocado",
            "Cucumber",
            "Spinach",
            "Mint",
            "Lime",
            "Honey",
            "Olive Oil"
        ]
    },
    {
        "idMeal": 19,
        "price":310,
        "rating":3.5,
        "strMeal": "Salmon Prawn Risotto",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Italian",
        "strInstructions": "Melt the butter in a thick-based pan and gently cook the onion without colour until it is soft.\r\nAdd the rice and stir to coat all the grains in the butter\r\nAdd the wine and cook gently stirring until it is absorbed\r\nGradually add the hot stock, stirring until each addition is absorbed. Keep stirring until the rice is tender\r\nSeason with the lemon juice and zest, and pepper to taste. (there will probably be sufficient saltiness from the salmon to not need to add salt) Stir gently to heat through\r\nServe scattered with the Parmesan and seasonal vegetables.\r\nGrill the salmon and gently place onto the risotto with the prawns and asparagus",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xxrxux1503070723.jpg",
        "strTags": "Fish",
        "strYoutube": "https://www.youtube.com/watch?v=V2PMvBv52IE",
        "strIngredient": [
            "butter",
            "onion",
            "rice",
            "white wine",
            "vegetable stock",
            "lemon",
            "King Prawns",
            "salmon",
            "asparagus",
            "black pepper",
            "Parmesan"
        ]
    },
    {
        "idMeal": 20,
        "price":210,
        "rating":3.9,
        "strMeal": "Saltfish and Ackee",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Jamaican",
        "strInstructions": "For the saltfish, soak the salt cod overnight, changing the water a couple of times.\r\nDrain, then put the cod in a large pan of fresh water and bring to the boil. Drain again, add fresh water and bring to the boil again.\r\nSimmer for about five minutes, or until cooked through, then drain and flake the fish into large pieces. Discard any skin or bones.\r\nFor the dumplings, mix the flour and suet with a pinch of salt and 250ml/9fl oz water to make a dough.\r\nWrap the mixture in clingfilm and leave in the fridge to rest.\r\nOpen the can of ackee, drain and rinse, then set aside.\r\nHeat a tablespoon of olive oil in a pan and fry the onion until softened but not brown.\r\nAdd the spices, seasoning, pepper sauce and sliced peppers and continue to fry until the peppers are tender.\r\nAdd the chopped tomatoes, then the salt cod and mix together. Lastly stir in the ackee very gently and leave to simmer until ready to serve.\r\nWhen you’re almost ready to eat, heat about 1cm/½in vegetable oil in a frying pan and heat until just smoking.\r\nShape the dumpling mix into plum-size balls and shallow-fry until golden-brown. (CAUTION: hot oil can be dangerous. Do not leave the pan unattended.)\r\nDrain the dumplings on kitchen paper and serve with the saltfish and ackee.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/vytypy1511883765.jpg",
        "strTags": "Speciality",
        "strYoutube": "https://www.youtube.com/watch?v=nbfNyZbdn2I",
        "strIngredient": [
            "Salt Cod",
            "Ackee",
            "Onion",
            "Paprika",
            "Curry Powder",
            "Jerusalem Artichokes",
            "Hotsauce",
            "Red Pepper",
            "Yellow Pepper",
            "Tomatoes",
            "Salt",
            "Pepper",
            "Self-raising Flour",
            "Suet",
            "Salt"
        ]
    },
    {
        "idMeal": 21,
        "price":126,
        "rating":4,
        "strMeal": "Seafood fideuà",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Spanish",
        "strInstructions": "Boil the kettle. Empty the mussels into a colander and run under cold water. Throw away any with broken shells. Pick through the shells, tapping each one on the side of the sink – they should be closed or should slowly close when tapped – if they stay open, throw them away. If any of the shells still have barnacles or stringy beards attached, pull them off with a cutlery knife and rinse the shells well. Keep in the colander, covered with a cold, damp cloth, until you’re ready to cook. Peel the prawn shells on the body section only – leave the heads and tails intact. Score down the backs and pull out any gritty entrails. Chill until you’re ready to cook.\r\nPut the saffron in a small cup, cover with 50ml kettle-hot water and set aside for 10 mins. If using vermicelli, put in a bowl and crush to little pieces (about 1cm long) with your hands.\r\nHeat the oil in a large frying pan with at least a 3cm lip, or a 40cm paella pan. Add the onion and stir around the pan for 5 mins until soft. Add the garlic and cook for 1 min more, then tip in the vermicelli and cook for 5 mins, stirring from time to time, until the vermicelli is toasted brown. Stir in the paprika.\r\nKeeping the heat moderate, stir through the monkfish, squid and saffron with its water, seasoning well. Spread the ingredients out in an even layer, then pour over the hot stock and scatter the tomatoes on top. Bring to a simmer, then cover the whole dish with a tight-fitting lid (or foil). Turn the heat to medium and cook for 6 mins.\r\nUncover and stir to incorporate the dry top layer of pasta. Push the mussels into the pasta so the hinges are buried in the bottom of the dish, and they stand straight up. Arrange the prawns on top, cover tightly and cook for another 6 mins or until the mussels are open, the prawns are pink and the pasta is cooked through. Leave to simmer for another 2-3 mins to cook off most of the remaining liquid (leave a little in the pan to prevent the pasta from sticking together). Allow to sit for 2-3 mins, then squeeze over the lemon juice and arrange the wedges on top. Scatter with parsley before serving.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wqqvyq1511179730.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=itsFEc8W468",
        "strIngredient": [
            "Mussels",
            "Vermicelli",
            "Prawns",
            "Saffron",
            "Olive Oil",
            "Onions",
            "Garlic",
            "Paprika",
            "Monkfish",
            "Baby Squid",
            "Fish Stock",
            "Tomatoes",
            "Lemon",
            "Parsley"
        ]
    },
    {
        "idMeal": 23,
        "price":376,
        "rating":4.4,
        "strMeal": "Shrimp Chow Fun",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Chinese",
        "strInstructions": "STEP 1 - SOAK THE RICE NOODLES\r\nSoak the rice noodles overnight untill they are soft\r\nSTEP 2 - BOIL THE RICE NOODLES\r\nBoil the noodles for 10-15 minutes and then rinse with cold water to stop the cooking process of the noodles.\r\nSTEP 3 -MARINATING THE SHRIMP\r\nIn a bowl add the shrimp, egg, 1 pinch of white pepper, 1 Teaspoon of sesame seed oil, 1 Tablespoon corn starch and 1 tablespoon of oil\r\nMix together well\r\nSTEP 4 - STIR FRY\r\nIn a wok add 2 Tablespoons of oil, shrimp and stir fry them until it is golden brown\r\nSet the shrimp aside\r\nAdd 1 Tablespoon of oil to the work and then add minced garlic, ginger and all of the vegetables.\r\nAdd the noodles to the wok\r\nNext add sherry cooking wine, oyster sauce, sugar, vinegar, sesame seed oil, 1 pinch white pepper, and soy sauce\r\nAdd back in the shrimp\r\nTo thicken the sauce, whisk together 1 Tablespoon of corn starch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1529445434.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=wzaTcpoFEaY",
        "strIngredient": [
            "Rice Stick Noodles",
            "Prawns",
            "Egg",
            "Pepper",
            "Sesame Seed Oil",
            "Cornstarch",
            "Minced Garlic",
            "Ginger",
            "Onion",
            "Bean Sprouts",
            "Spring Onions",
            "Cooking wine",
            "Oyster Sauce",
            "Sugar",
            "Vinegar",
            "Soy Sauce"
        ]
    },
    {
        "idMeal": 24,
        "price":89,
        "rating":4.4,
        "strMeal": "Sledz w Oleju (Polish Herrings)",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Polish",
        "strInstructions": "Soak herring in cold water for at least 1 hour. If very salty, repeat, changing the water each time.\r\n\r\nDrain thoroughly and slice herring into bite-size pieces.\r\n\r\nPlace in a jar large enough to accommodate the pieces and cover with oil, allspice, peppercorns, and bay leaf. Close the jar.\r\n\r\nRefrigerate for 2 to 3 days before eating. This will keep refrigerated up to 2 weeks.\r\n\r\nServe with finely chopped onion or onion slices, lemon, and parsley or dill.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/7ttta31593350374.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=v6I3GZlBkOM",
        "strIngredient": [
            "Herring",
            "Onion",
            "Olive Oil",
            "Allspice",
            "Pepper",
            "Bay Leaf"
        ]
    },
    {
        "idMeal": 25,
        "price":94,
        "rating":5,
        "strMeal": "Spring onion and prawn empanadas",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Portuguese",
        "strInstructions": "STEP 1\r\n\r\nTo make the dough, rub the butter into the flour and then add the egg white and half the yolk (keep the rest), vinegar, a pinch of salt and enough cold water to make a soft dough. Knead on a floured surface until smooth and then wrap and rest for 30 minutes.\r\n\r\nSTEP 2\r\n\r\nHeat the oven to 180c/fan 160c/gas 4. Trim the green ends of the spring onions and then finely slice the rest. Heat a little oil in a pan and fry them gently until soft but not browned. Add the chilli and garlic, stir and then add the prawns and cook until they are opaque. Season well. Scoop out the prawns and bubble the juices until they thicken, then add back the prawns.\r\n\r\nSTEP 3\r\n\r\nDivide the empanada dough into eight balls and roll out to thin circles on a floured surface. Put some filling on one half of the dough, sprinkle the feta on top and fold the other half over. Trim the edge and then fold and crimp the dough together so the empanada is tightly sealed, put it on an oiled baking sheet either on its side or sitting on its un-crimped edge like a cornish pasty. Repeat with the remaining dough and mixture. Mix the leftover egg yolk with a splash of water and brush the top of the empanadas.\r\n\r\nSTEP 4\r\n\r\nBake for 30 minutes or until golden and slightly crisp around the edges.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1c5oso1614347493.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=Q24haJU-1dI",
        "strIngredient": [
            "Spring Onions",
            "Olive Oil",
            "Red Chilli",
            "Garlic",
            "Prawns",
            "Feta",
            "Butter",
            "Plain Flour",
            "Egg",
            "White Wine Vinegar"
        ]
    },
    {
        "idMeal": 26,
        "price":76,       
        "strMeal": "Sushi",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Japanese",
        "strInstructions": "STEP 1\r\nTO MAKE SUSHI ROLLS: Pat out some rice. Lay a nori sheet on the mat, shiny-side down. Dip your hands in the vinegared water, then pat handfuls of rice on top in a 1cm thick layer, leaving the furthest edge from you clear.\r\n\r\nSTEP 2\r\nSpread over some Japanese mayonnaise. Use a spoon to spread out a thin layer of mayonnaise down the middle of the rice.\r\n\r\nSTEP 3\r\nAdd the filling. Get your child to top the mayonnaise with a line of their favourite fillings – here we’ve used tuna and cucumber.\r\n\r\nSTEP 4\r\nRoll it up. Lift the edge of the mat over the rice, applying a little pressure to keep everything in a tight roll.\r\n\r\nSTEP 5\r\nStick down the sides like a stamp. When you get to the edge without any rice, brush with a little water and continue to roll into a tight roll.\r\n\r\nSTEP 6\r\nWrap in cling film. Remove the mat and roll tightly in cling film before a grown-up cuts the sushi into thick slices, then unravel the cling film.\r\n\r\nSTEP 7\r\nTO MAKE PRESSED SUSHI: Layer over some smoked salmon. Line a loaf tin with cling film, then place a thin layer of smoked salmon inside on top of the cling film.\r\n\r\nSTEP 8\r\nCover with rice and press down. Press about 3cm of rice over the fish, fold the cling film over and press down as much as you can, using another tin if you have one.\r\n\r\nSTEP 9\r\nTip it out like a sandcastle. Turn block of sushi onto a chopping board. Get a grown-up to cut into fingers, then remove the cling film.\r\n\r\nSTEP 10\r\nTO MAKE SUSHI BALLS: Choose your topping. Get a small square of cling film and place a topping, like half a prawn or a small piece of smoked salmon, on it. Use damp hands to roll walnut-sized balls of rice and place on the topping.\r\n\r\nSTEP 11\r\nMake into tight balls. Bring the corners of the cling film together and tighten into balls by twisting it up, then unwrap and serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/g046bb1663960946.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=ub68OxEypaY",
        "strIngredient": [
            "Sushi Rice",
            "Rice wine",
            "Caster Sugar",
            "Mayonnaise",
            "Rice wine",
            "Soy Sauce"
        ]
    },
    {
        "idMeal": 27,
        "price":76,       
        "strMeal": "Three Fish Pie",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "British",
        "strInstructions": "Preheat the oven to 200C/400F/Gas 6 (180C fan).\r\nPut the potatoes into a saucepan of cold salted water. Bring up to the boil and simmer until completely tender. Drain well and then mash with the butter and milk. Add pepper and taste to check the seasoning. Add salt and more pepper if necessary.\r\nFor the fish filling, melt the butter in a saucepan, add the leeks and stir over the heat. Cover with a lid and simmer gently for 10 minutes, or until soft. Measure the flour into a small bowl. Add the wine and whisk together until smooth.\r\nAdd the milk to the leeks, bring to the boil and then add the wine mixture. Stir briskly until thickened. Season and add the parsley and fish. Stir over the heat for two minutes, then spoon into an ovenproof casserole. Scatter over the eggs. Allow to cool until firm.\r\nSpoon the mashed potatoes over the fish mixture and mark with a fork. Sprinkle with cheese.\r\nBake for 30-40 minutes, or until lightly golden-brown on top and bubbling around the edges.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/spswqs1511558697.jpg",
        "strTags": "Fish,Seafood,Dairy,Pie",
        "strYoutube": "https://www.youtube.com/watch?v=Ds1Jb8H5Sg8",
        "strIngredient": [
            "Potatoes",
            "Butter",
            "Milk",
            "Gruyère",
            "Butter",
            "Leek",
            "Plain Flour",
            "White Wine",
            "Milk",
            "Parsley",
            "Salmon",
            "Haddock",
            "Smoked Haddock",
            "Eggs"
        ]
    },
    {
        "idMeal": 28,
        "price":120,
        "rating":4,
        "strMeal": "Tuna and Egg Briks",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "Tunisian",
        "strInstructions": "Heat 2 tsp of the oil in a large saucepan and cook the spring onions over a low heat for 3 minutes or until beginning to soften. Add the spinach, cover with a tight-fitting lid and cook for a further 2–3 minutes or until tender and wilted, stirring once or twice. Tip the mixture into a sieve or colander and leave to drain and cool.\r\nUsing a saucer as a guide, cut out 24 rounds about 12.5 cm (5 in) in diameter from the filo pastry, cutting 6 rounds from each sheet. Stack the filo rounds in a pile, then cover with cling film to prevent them from drying out.\r\nWhen the spinach mixture is cool, squeeze out as much excess liquid as possible, then transfer to a bowl. Add the tuna, eggs, hot pepper sauce, and salt and pepper to taste. Mix well.\r\nPreheat the oven to 200°C (400°F, gas mark 6). Take one filo round and very lightly brush with some of the remaining oil. Top with a second round and brush with a little oil, then place a third round on top and brush with oil.\r\nPlace a heaped tbsp of the filling in the middle of the round, then fold the pastry over to make a half-moon shape. Fold in the edges, twisting them to seal, and place on a non-stick baking sheet. Repeat with the remaining pastry and filling to make 8 briks in all.\r\nLightly brush the briks with the remaining oil. Bake for 12–15 minutes or until the pastry is crisp and golden brown.\r\nMeanwhile, combine the tomatoes and cucumber in a bowl and sprinkle with the lemon juice and seasoning to taste. Serve the briks hot with this salad and the chutney.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/2dsltq1560461468.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=C5n1fN8TGHs",
        "strIngredient": [
            "Olive Oil",
            "Spring Onions",
            "Spinach",
            "Filo Pastry",
            "Tuna",
            "Eggs",
            "Hotsauce",
            "Tomatoes",
            "Cucumber",
            "Lemon Juice",
            "Apricot Jam"
        ]
    },
    {
        "idMeal": 29,
        "price":49,
        "rating":4.4,
        "strMeal": "Tuna Nicoise",
        "strDrinkAlternate": null,
        "strCategory": "Seafood",
        "strArea": "French",
        "strInstructions": "Heat oven to 200C/fan 180C/gas 6. Toss the potatoes with 2 tsp oil and some seasoning. Tip onto a large baking tray, then roast for 20 mins, stirring halfway, until crisp, golden and cooked through.\r\nMeanwhile, put eggs in a small pan of water, bring to the boil, then simmer for 8-10 mins, depending on how you like them cooked. Plunge into a bowl of cold water to cool for a few mins. Peel away the shells, then cut into halves.\r\nIn a large salad bowl, whisk together the remaining oil, red wine vinegar, capers and chopped tomatoes. Season, tip in the onion, spinach, tuna and potatoes, then gently toss together. Top with the eggs, then serve straight away.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/yypwwq1511304979.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=3_UAxkx0u6U",
        "strIngredient": [
            "Potatoes",
            "Olive Oil",
            "Eggs",
            "Red Wine Vinegar",
            "Capers",
            "Sunflower Oil",
            "Red Onions",
            "Spinach",
            "Tuna"
        ]
    },
    {
        "idMeal": 30,
        "price":76,
        "rating":4,
        "strMeal": "Roast fennel and aubergine paella",
        "strDrinkAlternate": null,
        "strCategory": "Vegan",
        "strArea": "Spanish",
        "strInstructions": "1 Put the fennel, aubergine, pepper and courgette in a roasting tray. Add a glug of olive oil, season with salt and pepper and toss around to coat the veggies in the oil. Roast in the oven for 20 minutes, turning a couple of times until the veg are pretty much cooked through and turning golden.\r\n\r\n2 Meanwhile, heat a paella pan or large frying pan over a low– medium heat and add a glug of olive oil. Sauté the onion for 8–10 minutes until softened. Increase the heat to medium and stir in the rice, paprika and saffron. Cook for around 1 minute to start toasting the rice, then add the white wine. Reduce by about half before stirring in two-thirds of the stock. Reduce to a simmer and cook for 10 minutes without a lid, stirring a couple of times.\r\n\r\n3 Stir in the peas, add some seasoning, then gently mix in the roasted veg. Pour over the remaining stock, arrange the lemon wedges on top and cover with a lid or some aluminium foil. Cook for a further 10 minutes.\r\n\r\n4 To ensure you get the classic layer of toasted rice at the bottom of the pan, increase the heat to high until you hear a slight crackle. Remove from the heat and sit for 5 minutes before sprinkling over the parsley and serving.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1520081754.jpg",
        "strTags": "Vegan,Paella",
        "strYoutube": "https://www.youtube.com/watch?v=H5SmjR-fxUs",
        "strIngredient": [
            "Baby Aubergine",
            "Fennel",
            "Red Pepper",
            "Courgettes",
            "Onion",
            "Saffron",
            "White Wine",
            "Vegetable Stock",
            "Frozen Peas",
            "Lemon",
            "Parsley",
            "Salt",
            "Black Pepper"
        ]
    },
    {
        "idMeal": 31,
        "price":176,
        "rating":4.4,
        "strMeal": "Vegan Chocolate Cake",
        "strDrinkAlternate": null,
        "strCategory": "Vegan",
        "strArea": "American",
        "strInstructions": "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate ",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg",
        "strTags": "Vegan,Chocolate,Cake",
        "strYoutube": "https://www.youtube.com/watch?v=C3pAgB7pync",
        "strIngredient": [
            "self raising flour",
            "coco sugar",
            "cacao",
            "baking powder",
            "flax eggs",
            "almond milk",
            "vanilla"
        ]
    },
    {
        "idMeal": 32,
        "price":279,
        "rating":4.7,
        "strMeal": "Vegan Lasagna",
        "strDrinkAlternate": null,
        "strCategory": "Vegan",
        "strArea": "Italian",
        "strInstructions": "1) Preheat oven to 180 degrees celcius. \r\n2) Boil vegetables for 5-7 minutes, until soft. Add lentils and bring to a gentle simmer, adding a stock cube if desired. Continue cooking and stirring until the lentils are soft, which should take about 20 minutes. \r\n3) Blanch spinach leaves for a few minutes in a pan, before removing and setting aside. \r\n4) Top up the pan with water and cook the lasagne sheets. When cooked, drain and set aside.\r\n5) To make the sauce, melt the butter and add the flour, then gradually add the soya milk along with the mustard and the vinegar. Cook and stir until smooth and then assemble the lasagne as desired in a baking dish. \r\n6) Bake in the preheated oven for about 25 minutes.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/rvxxuy1468312893.jpg",
        "strTags": "Vegan,Pasta",
        "strYoutube": "https://www.youtube.com/watch?v=VU8cXvlGbvc",
        "strIngredient": [
            "green red lentils",
            "carrot",
            "onion",
            "zucchini",
            "coriander",
            "spinach",
            "lasagne sheets",
            "vegan butter",
            "flour",
            "soya milk",
            "mustard",
            "vinegar"
        ]
    },
    {
        "idMeal": 33,
        "price":199,
        "rating":4.2,
        "strMeal": "Apam balik",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "Malaysian",
        "strInstructions": "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\r\n\r\nSpread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\r\n\r\nAdd butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\r\n\r\nCut into wedges and best eaten when it is warm.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=6R8ffRRJcrg",
        "strIngredient": [
            "Milk",
            "Oil",
            "Eggs",
            "Flour",
            "Baking Powder",
            "Salt",
            "Unsalted Butter",
            "Sugar",
            "Peanut Butter"
        ]
    },
    {
        "idMeal": 34,
        "price":176,
        "rating":4.1,
        "strMeal": "Apple & Blackberry Crumble",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured.\r\nMeanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan.\r\nTo serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg",
        "strTags": "Pudding",
        "strYoutube": "https://www.youtube.com/watch?v=4vhcOwVBDO4",
        "strIngredient": [
            "Plain Flour",
            "Caster Sugar",
            "Butter",
            "Braeburn Apples",
            "Butter",
            "Demerara Sugar",
            "Blackberrys",
            "Cinnamon"
        ]
    },
    {
        "idMeal": 35,
        "price":20,
        "rating":4,
        "strMeal": "Apple Frangipan Tart",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Preheat the oven to 200C/180C Fan/Gas 6.\r\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r\nBake for 20-25 minutes until golden-brown and set.\r\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg",
        "strTags": "Tart,Baking,Fruity",
        "strYoutube": "https://www.youtube.com/watch?v=rp8Slv4INLk",
        "strIngredient": [
            "digestive biscuits",
            "butter",
            "Bramley apples",
            "butter, softened",
            "caster sugar",
            "free-range eggs, beaten",
            "ground almonds",
            "almond extract",
            "flaked almonds"
        ]
    },
    {
        "idMeal": 36,
        "price":89,
        "rating":4.7,
        "strMeal": "Bakewell tart",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough.\r\nRoll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 (180C fan).\r\nLine the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.\r\nFor the filing, spread the base of the flan generously with raspberry jam.\r\nMelt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.\r\nBake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wyrqqq1468233628.jpg",
        "strTags": "Tart,Baking,Alcoholic",
        "strYoutube": "https://www.youtube.com/watch?v=1ahpSTf_Pvk",
        "strIngredient": [
            "plain flour",
            "chilled butter",
            "cold water",
            "raspberry jam",
            "butter",
            "caster sugar",
            "ground almonds",
            "free-range egg, beaten",
            "almond extract",
            "flaked almonds"
        ]
    },
    {
        "idMeal": 37,
        "price":97,
        "rating":4.5,
        "strMeal": "Banana Pancakes",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "American",
        "strInstructions": "In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.\r\nHeat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/sywswr1511383814.jpg",
        "strTags": "Breakfast,Desert,Sweet",
        "strYoutube": "https://www.youtube.com/watch?v=kSKtb2Sv-_U",
        "strIngredient": [
            "Banana",
            "Eggs",
            "Baking Powder",
            "Vanilla Extract",
            "Oil",
            "Pecan Nuts",
            "Raspberries"
        ]
    },
    {
        "idMeal": 38,
        "price":69,
        "rating":4.5,
        "strMeal": "Battenberg Cake",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Heat oven to 180C/160C fan/gas 4 and line the base and sides of a 20cm square tin with baking parchment (the easiest way is to cross 2 x 20cm-long strips over the base). To make the almond sponge, put the butter, sugar, flour, ground almonds, baking powder, eggs, vanilla and almond extract in a large bowl. Beat with an electric whisk until the mix comes together smoothly. Scrape into the tin, spreading to the corners, and bake for 25-30 mins – when you poke in a skewer, it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling while you make the second sponge.\r\nFor the pink sponge, line the tin as above. Mix all the ingredients together as above, but don’t add the almond extract. Fold in some pink food colouring. Then scrape it all into the tin and bake as before. Cool.\r\nTo assemble, heat the jam in a small pan until runny, then sieve. Barely trim two opposite edges from the almond sponge, then well trim a third edge. Roughly measure the height of the sponge, then cutting from the well-trimmed edge, use a ruler to help you cut 4 slices each the same width as the sponge height. Discard or nibble leftover sponge. Repeat with pink cake.\r\nTake 2 x almond slices and 2 x pink slices and trim so they are all the same length. Roll out one marzipan block on a surface lightly dusted with icing sugar to just over 20cm wide, then keep rolling lengthways until the marzipan is roughly 0.5cm thick. Brush with apricot jam, then lay a pink and an almond slice side by side at one end of the marzipan, brushing jam in between to stick sponges, and leaving 4cm clear marzipan at the end. Brush more jam on top of the sponges, then sandwich remaining 2 slices on top, alternating colours to give a checkerboard effect. Trim the marzipan to the length of the cakes.\r\nCarefully lift up the marzipan and smooth over the cake with your hands, but leave a small marzipan fold along the bottom edge before you stick it to the first side. Trim opposite side to match size of fold, then crimp edges using fingers and thumb (or, more simply, press with prongs of fork). If you like, mark the 10 slices using the prongs of a fork.\r\nAssemble second Battenberg and keep in an airtight box or well wrapped in cling film for up to 3 days. Can be frozen for up to a month.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/ywwrsp1511720277.jpg",
        "strTags": "Cake,Sweet",
        "strYoutube": "https://www.youtube.com/watch?v=aB41Q7kDZQ0",
        "strIngredient": [
            "Butter",
            "Caster Sugar",
            "Self-raising Flour",
            "Almonds",
            "Baking Powder",
            "Eggs",
            "Vanilla Extract",
            "Almond Extract",
            "Butter",
            "Caster Sugar",
            "Self-raising Flour",
            "Almonds",
            "Baking Powder",
            "Eggs",
            "Vanilla Extract",
            "Almond Extract",
            "Pink Food Colouring",
            "Apricot",
            "Marzipan",
            "Icing Sugar"
        ]
    },
    {
        "idMeal": 39,
        "price":56,
        "rating":2.4,
        "strMeal": "BeaverTails",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "Canadian",
        "strInstructions": "In the bowl of a stand mixer, add warm water, a big pinch of sugar and yeast. Allow to sit until frothy.\r\nInto the same bowl, add 1/2 cup sugar, warm milk, melted butter, eggs and salt, and whisk until combined.\r\nPlace a dough hook on the mixer, add the flour with the machine on, until a smooth but slightly sticky dough forms.\r\nPlace dough in a bowl, cover with plastic wrap, and allow to proof for 1 1/2 hours.\r\nCut dough into 12 pieces, and roll out into long oval-like shapes about 1/4 inch thick that resemble a beaver’s tail.\r\nIn a large, deep pot, heat oil to 350 degrees. Gently place beavertail dough into hot oil and cook for 30 to 45 seconds on each side until golden brown.\r\nDrain on paper towels, and garnish as desired. Toss in cinnamon sugar, in white sugar with a squeeze of lemon, or with a generous slathering of Nutella and a handful of toasted almonds. Enjoy!",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/ryppsv1511815505.jpg",
        "strTags": "Treat,Pudding,Speciality",
        "strYoutube": "https://www.youtube.com/watch?v=2G07UOqU2e8",
        "strIngredient": [
            "Water",
            "Yeast",
            "Sugar",
            "Milk",
            "Butter",
            "Eggs",
            "Salt",
            "Flour",
            "Oil",
            "Lemon",
            "Sugar",
            "Cinnamon"
        ]
    },
    {
        "idMeal": 40,
        "price":271,
        "rating":1.9,
        "strMeal": "Chinon Apple Tarts",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "French",
        "strInstructions": "To make the red wine jelly, put the red wine, jam sugar, star anise, clove, cinnamon stick, allspice, split vanilla pod and seeds in a medium saucepan. Stir together, then heat gently to dissolve the sugar. Turn up the heat and boil for 20 mins until reduced and syrupy. Strain into a small, sterilised jam jar and leave to cool completely. Will keep in the fridge for up to 1 month.\r\n\r\nTake the pastry out of the fridge and leave at room temperature for 10 mins, then unroll. Heat the grill to high and heat the oven to 180C/160C fan/gas 4. Cut out 2 x 13cm circles of pastry, using a plate as a guide, and place on a non-stick baking sheet. Sprinkle each circle with 1 tbsp sugar and grill for 5 mins to caramelise, watching carefully so that the sugar doesn’t burn. Remove from the grill. Can be done a few hours ahead, and left, covered, out of the fridge.\r\n\r\nPeel, quarter and core the apples, cut into 2mm-thin slices and arrange on top of the pastry. Sprinkle over the remaining sugar and pop in the oven for 20-25 mins until the pastry is cooked through and golden, and the apples are softened. Remove and allow to cool slightly. Warm 3 tbsp of the red wine jelly in a small pan over a low heat with 1 tsp water to make it a little more runny, then brush over the top of the tarts.\r\n\r\nTip the crème fraîche into a bowl, sift over the icing sugar and cardamom, and mix together. Carefully lift the warm tarts onto serving plates and serve with the cardamom crème fraîche.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/qtqwwu1511792650.jpg",
        "strTags": "Tart,Baking",
        "strYoutube": "https://www.youtube.com/watch?v=5dAW9HQgtCk",
        "strIngredient": [
            "Puff Pastry",
            "Dark Brown Soft Sugar",
            "Braeburn Apples",
            "Red Wine Jelly",
            "Creme Fraiche",
            "Icing Sugar",
            "Cardamom"
        ]
    },
    {
        "idMeal": 41,
        "price":376,
        "rating":3.6,
        "strMeal": "Choc Chip Pecan Pie",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "American",
        "strInstructions": "First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6.\r\n\r\nRemove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps.\r\n\r\nMeanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3.\r\n\r\nBeat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg",
        "strTags": "Pie,Desert,Sweet,Nutty",
        "strYoutube": "https://www.youtube.com/watch?v=fDpoT0jvg4Y",
        "strIngredient": [
            "Plain Flour",
            "Butter",
            "Cream Cheese",
            "Icing Sugar",
            "Butter",
            "Maple Syrup",
            "Light Brown Soft Sugar",
            "Dark Brown Soft Sugar",
            "Eggs",
            "Vanilla Extract",
            "Pecan Nuts",
            "Dark Chocolate Chips"
        ]
    },
    {
        "idMeal": 42,
        "price":276,
        "rating":3.8,
        "strMeal": "Chocolate Avocado Mousse",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "1. Blend all the mousse ingredients together in your food processor until smooth. Add the cacao powder first and, as you blend, have all the ingredients to hand in order to adjust the ratios slightly as the size of avocados and bananas varies so much. The perfect ratio in order to avoid the dish tasting too much of either is to use equal amounts of both.\r\n\r\n2. Taste and add a few drops of stevia if you feel you need more sweetness.\r\n\r\n3. Fill little cups or shot glasses with the mousse, sprinkle with the cacao powder or nibs and serve.\r\n\r\nTip If you don’t have a frozen banana to hand you can just use a normal one and then chill the mousse before serving for a cooling dessert.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/uttuxy1511382180.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=wuZffe60q4M",
        "strIngredient": [
            "Banana",
            "Cacao",
            "Avocado",
            "Honey",
            "Lemon Juice",
            "Vanilla",
            "Water"
        ]
    },
    {
        "idMeal": 43,
        "price":95,
        "rating":3.9,
        "strMeal": "Chocolate Caramel Crispy",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Grease and line a 20 x 20cm/8\" x 8\" baking tin with parchment paper.\r\nPut the mars bars and butter in a heat proof bowl and place over a pan of barely simmering water. Mixing with a whisk, melt until the mixture is smooth.\r\nPour over the rice krispies in a mixing bowl and mix until all the ingredients are evenly combined. Press evenly into the prepare baking tin and set aside.\r\nMelt the milk chocolate in the microwave or over a pan of barely simmering water.\r\nSpread the melted chocolate over the rice krispie mixture and leave to set in a cool place. Once set slice into squares and serve!",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1550442508.jpg",
        "strTags": "Sweet,Snack,Treat,Tart,Alcoholic,BBQ",
        "strYoutube": "https://www.youtube.com/watch?v=qsk_At_gjv0",
        "strIngredient": [
            "Mars Bar",
            "Butter",
            "Rice Krispies",
            "Milk Chocolate"
        ]
    },
    {
        "idMeal": 44,
        "price":69,
        "rating":3.9,
        "strMeal": "Chocolate Gateau",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "French",
        "strInstructions": "Preheat the oven to 180°C/350°F/Gas Mark 4. Grease and line the base of an 8 in round spring form cake tin with baking parchment\r\nBreak the chocolate into a heatproof bowl and place over a saucepan of gently simmering water and stir until it melts. (or melt in the microwave for 2-3 mins stirring occasionally)\r\nPlace the butter and sugar in a mixing bowl and cream together with a wooden spoon until light and fluffy. Gradually beat in the eggs, adding a little flour if the mixture begins to curdle. Fold in the remaining flour with the cooled, melted chocolate and milk. Mix until smooth.\r\nSpread the mixture into the cake tin and bake for 50-55 mins or until firm in the centre and a skewer comes out cleanly. Cool for 10 minutes, then turn out and cool completely.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/tqtywx1468317395.jpg",
        "strTags": "Cake,Chocolate,Desert,Pudding",
        "strYoutube": "https://www.youtube.com/watch?v=dsJtgmAhFF4",
        "strIngredient": [
            "Plain chocolate",
            "Butter",
            "Milk",
            "Eggs",
            "Granulated Sugar",
            "Flour"
        ]
    },
    {
        "idMeal": 45,
        "price":176,
        "rating":3.4,
        "strMeal": "Chocolate Raspberry Brownies",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "American",
        "strInstructions": "Heat oven to 180C/160C fan/gas 4. Line a 20 x 30cm baking tray tin with baking parchment. Put the chocolate, butter and sugar in a pan and gently melt, stirring occasionally with a wooden spoon. Remove from the heat.\r\nStir the eggs, one by one, into the melted chocolate mixture. Sieve over the flour and cocoa, and stir in. Stir in half the raspberries, scrape into the tray, then scatter over the remaining raspberries. Bake on the middle shelf for 30 mins or, if you prefer a firmer texture, for 5 mins more. Cool before slicing into squares. Store in an airtight container for up to 3 days.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/yypvst1511386427.jpg",
        "strTags": "Chocolate,Desert,Snack",
        "strYoutube": "https://www.youtube.com/watch?v=Pi89PqsAaAg",
        "strIngredient": [
            "Dark Chocolate",
            "Milk Chocolate",
            "Salted Butter",
            "Light Brown Soft Sugar",
            "Eggs",
            "Plain Flour",
            "Cocoa",
            "Raspberries"
        ]
    },
    {
        "idMeal": 46,
        "price":236,
        "rating":4.4,
        "strMeal": "Chocolate Souffle",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "French",
        "strInstructions": "Heat oven to 220C/fan 200C/gas 7 and place a baking tray on the top shelf. For the sauce, heat the cream and sugar until boiling. Remove from the heat, stir in the chocolate and butter until melted, then keep warm.\r\nBrush 6 x 150ml ramekins with melted butter, sprinkle with the 2 tbsp caster sugar, then tip out any excess. Melt the chocolate and cream in a bowl over a pan of simmering water, cool, then mix in the egg yolks. Whisk the egg whites until they hold their shape, then add the sugar, 1 tbsp at a time, whisking back to the same consistency. Mix a spoonful into the chocolate, then gently fold in the rest.\r\nWorking quickly, fill the ramekins, wipe the rims clean and run your thumb around the edges. Turn oven down to 200C/fan 180C/gas 6, place the ramekins onto the baking tray, then bake for 8-10 mins until risen with a slight wobble. Don’t open the oven door too early as this may make them collapse.\r\nOnce the soufflés are ready, dust with icing sugar, scoop a small hole from their tops, then pour in some of the hot chocolate sauce. Replace the lids and serve straight away.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/twspvx1511784937.jpg",
        "strTags": "DinnerParty,Desert,Pudding,Chocolate",
        "strYoutube": "https://www.youtube.com/watch?v=FWqfkUEWOTg",
        "strIngredient": [
            "Single Cream",
            "Caster Sugar",
            "Dark Chocolate",
            "Butter",
            "Butter",
            "Caster Sugar",
            "Dark Chocolate",
            "Double Cream",
            "Egg Yolks",
            "Egg White",
            "Double Cream",
            "Icing Sugar"
        ]
    },
    {
        "idMeal": 47,
        "price":220,
        "rating":2,
        "strMeal": "Christmas cake",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Heat oven to 160C/fan 140C/gas 3. Line the base and sides of a 20 cm round, 7.5 cm deep cake tin. Beat the butter and sugar with an electric hand mixer for 1-2 mins until very creamy and pale in colour, scraping down the sides of the bowl half way through. Stir in a spoonful of the flour, then stir in the beaten egg and the rest of the flour alternately, a quarter at a time, beating well each time with a wooden spoon. Stir in the almonds.\r\n\r\nMix in the sherry (the mix will look curdled), then add the peel, cherries, raisins, cherries, nuts, lemon zest, spice, rosewater and vanilla. Beat together to mix, then stir in the baking powder.\r\n\r\nSpoon mixture into the tin and smooth the top, making a slight dip in the centre. Bake for 30 mins, then lower temperature to 150C/fan 130C/gas 2 and bake a further 2-2¼ hrs, until a skewer insterted in the middle comes out clean. Leave to cool in the tin, then take out of the tin and peel off the lining paper. When completely cold, wrap well in cling film and foil to store until ready to decorate. The cake will keep for several months.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/ldnrm91576791881.jpg",
        "strTags": "Christmas",
        "strYoutube": "https://www.youtube.com/watch?v=34yeL8TstO0",
        "strIngredient": [
            "Butter",
            "Muscovado Sugar",
            "Plain Flour",
            "Eggs",
            "Ground Almonds",
            "Sherry",
            "Candied Peel",
            "Glace Cherry",
            "Raisins",
            "Currants",
            "Pecan Nuts",
            "Lemon",
            "Mixed Spice",
            "Rose water",
            "Vanilla Extract",
            "Baking Powder"
        ]
    },
    {
        "idMeal": 48,
        "price":76,
        "rating":4,
        "strMeal": "Christmas Pudding Flapjack",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Preheat the oven to 180°C/fan 160°C/gas mark 4 and grease and line a 25cm x 20cm tin. Melt the butter, sugar, syrup and orange zest in a large saucepan over a medium heat. The aim is to dissolve all the ingredients so that they are smooth, but to not lose any volume through boiling so be careful not to overheat.\r\n\r\nAdd the oats and stir well until evenly coated. Stir through the leftover Christmas pudding and tip into the prepared tin. Use a spoon to flatten the top and bake for 40 minutes until the edges start to brown. Whilst still warm in the tin, score into 12 squares. Allow to cool completely before cutting along the scores.\r\n\r\nKeeps for 5 days in an air tight tin or freeze for up to 1 month.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/vvusxs1483907034.jpg",
        "strTags": "Snack,Cake",
        "strYoutube": "https://www.youtube.com/watch?v=OaqvGvEiwzU",
        "strIngredient": [
            "salted butter",
            "dark soft brown sugar",
            "golden syrup",
            "orange",
            "rolled oats",
            "Christmas pudding"
        ]
    },
    {
        "idMeal": 49,
        "price":49,
        "rating":5,
        "strMeal": "Christmas Pudding Trifle",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Peel the oranges using a sharp knife, ensuring all the pith is removed. Slice as thinly as possible and arrange over a dinner plate. Sprinkle with the demerara sugar followed by the Grand Marnier and set aside.\r\n\r\nCrumble the Christmas pudding into large pieces and scatter over the bottom of a trifle bowl. Lift the oranges onto the pudding in a layer and pour over any juices.\r\n\r\nBeat the mascarpone until smooth, then stir in the custard. Spoon the mixture over the top of the oranges.\r\n\r\nLightly whip the cream and spoon over the custard. Sprinkle with the flaked almonds and grated chocolate. You can make this a day in advance if you like, chill until ready to serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/r33cud1576791081.jpg",
        "strTags": "Christmas",
        "strYoutube": "https://www.youtube.com/watch?v=jRfyNQs5qhU",
        "strIngredient": [
            "Orange",
            "Demerara Sugar",
            "Grand Marnier",
            "Christmas Pudding",
            "Custard",
            "Mascarpone",
            "Double Cream",
            "Flaked Almonds",
            "Dark Chocolate"
        ]
    },
    {
        "idMeal": 50,
        "price":14,
        "rating":2.6,
        "strMeal": "Classic Christmas pudding",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Get everything for the pudding prepared. Chop the almonds coarsely. Peel, core and chop the cooking apples. Sharpen your knife and chop the candied peel. (You can chop the almonds and apples in a food processor, but the peel must be done by hand.) Grate three quarters of the nutmeg (sounds a lot but it's correct).\r\n\r\nMix the almonds, apples, candied peel, nutmeg, raisins, flour, breadcrumbs, light muscovado sugar, eggs and 2 tbsp brandy or cognac in a large bowl. \r\n\r\nHolding the butter in its wrapper, grate a quarter of it into the bowl, then stir everything together. Repeat until all the butter is grated, then stir for 3-4 mins – the mixture is ready when it subsides slightly after each stir. Ask the family to stir too, and get everyone to make a wish. \r\n\r\nGenerously butter two 1.2 litre bowls and put a circle of baking parchment in the bottom of each. Pack in the pudding mixture. Cover with a double layer of baking parchment, pleating it to allow for expansion, then tie with string (keep the paper in place with a rubber band while tying). Trim off any excess paper. \r\n\r\nNow stand each bowl on a large sheet of foil and bring the edges up over the top, then put another sheet of foil over the top and bring it down underneath to make a double package (this makes the puddings watertight). Tie with more string, and make a handle for easy lifting in and out of the pan. Watch our video to see how to tie up a pudding correctly.\r\n\r\nBoil or oven steam the puddings for 8 hrs, topping up with water as necessary. Remove from the pans and leave to cool overnight. When cold, discard the messy wrappings and re-wrap in new baking parchment, foil and string. Store in a cool, dry place until Christmas. \r\n\r\nTo make the brandy butter, cream the butter with the orange zest and icing sugar. Gradually beat in the brandy or cognac and chopped stem ginger. Put in a small bowl, fork the top attractively and put in the fridge to set. The butter will keep for a week in the fridge, or it can be frozen for up to six weeks. \r\n\r\nOn Christmas Day, boil or oven steam for 1 hr. Unwrap and turn out. To flame, warm 3-4 tbsp brandy in a small pan, pour it over the pudding and set light to it.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1d85821576790598.jpg",
        "strTags": "Christmas",
        "strYoutube": "https://www.youtube.com/watch?v=Pb_lJxL1vtk",
        "strIngredient": [
            "Almonds",
            "Bramley Apples",
            "Candied Peel",
            "Nutmeg",
            "Raisins",
            "Plain Flour",
            "Breadcrumbs",
            "Muscovado Sugar",
            "Eggs",
            "Brandy",
            "Butter"
        ]
    },
    {
        "idMeal": 51,
        "price":90,
        "rating":2.5,
        "strMeal": "Dundee cake",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Put the almonds into a small bowl and pour over boiling water to just cover. Leave for 5 mins then drain in a sieve and leave to dry.\r\nPreheat the oven to 180C/160 C fan/Gas Mark 4. Line a deep loose-based 20cm cake tin with baking parchment.\r\nPut the butter in a large bowl and beat well until soft. Add the sugar and beat until light and fluffy. Stir in the orange zest and apricot jam.\r\nSieve together the flour and baking powder. Add the eggs to the creamed butter and sugar, a little at a time, beating well between each addition. If the mixture starts to curdle, stir in a little flour.\r\nAdd the remaining flour and ground almonds and mix well. Mix in the milk and then add the dried fruit and cherries and mix gently together.\r\nSpoon the mixture into the prepared tin and spread level using the back of a spoon. Arrange the whole almonds close together in neat circles on the top of the cake. Bake in the oven for 45 mins.\r\nLower the oven temperature to 160C/140 C fan/Gas Mark 3 and cook for a further 60–80 minutes. Check the cake after 50 minutes by inserting a wooden or metal skewer into the cake. When it’s done it should have just a few crumbs attached. Check every 10 minutes - it’s important not to overcook this cake so the centre will be a little soft.\r\nWhen cooked, remove the cake briefly from the oven, put the milk and sugar into a small pan and heat gently until the sugar has dissolved. Brush over the top of the cake and return the cake to the oven for 2-3 mins. Remove and allow the cake to cool in the tin. When quite cold remove from the tin and wrap in foil and keep for at least 2 days before cutting.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wxyvqq1511723401.jpg",
        "strTags": "heavy,Nutty,Fruity",
        "strYoutube": "https://www.youtube.com/watch?v=4hEXsfpeMQE",
        "strIngredient": [
            "Almonds",
            "Butter",
            "Muscovado Sugar",
            "Orange",
            "Apricot Jam",
            "Plain Flour",
            "Baking Powder",
            "Eggs",
            "Ground Almonds",
            "Milk",
            "Dried Fruit",
            "Glace Cherry",
            "Milk",
            "Caster Sugar"
        ]
    },
    {
        "idMeal": 52,
        "price":120,        
        "strMeal": "Eccles Cakes",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "To make the pastry, dice the butter and put it in the freezer to go really hard. Tip flour into the bowl of a food processor with half the butter and pulse to the texture of breadcrumbs. Pour in the lemon juice and 100ml iced water, and pulse to a dough. Tip in the rest of the butter and pulse a few times until the dough is heavily flecked with butter. It is important that you don’t overdo this as the flecks of butter are what makes the pastry flaky.\r\nOn a floured surface roll the pastry out to a neat rectangle about 20 x 30cm. Fold the two ends of the pastry into the middle (See picture 1), then fold in half (pic 2). Roll the pastry out again and refold the same way 3 more times resting the pastry for at least 15 mins each time between roll and fold, then leave to rest in the fridge for at least 30 mins before using.\r\nTo make the filling, melt the butter in a large saucepan. Take it off the heat and stir in all the other ingredients until completely mixed, then set aside.\r\nTo make the cakes, roll the pastry out until it’s just a little thicker than a £1 coin and cut out 8 rounds about 12cm across. Re-roll the trimming if needed. Place a good heaped tablespoon of mixture in the middle of each round, brush the edges of the rounds with water, then gather the pastry around the filling and squeeze it together (pic 3). Flip them over so the smooth top is upwards and pat them into a smooth round. Flatten each round with a rolling pin to an oval until the fruit just starts to poke through, then place on a baking tray. Cut 2 little slits in each Eccles cakes, brush generously with egg white and sprinkle with the sugar (pic 4).\r\nHeat the oven to 220C/200C fan/gas 8. Bake the Eccles cakes for 15-20 mins until just past golden brown and sticky. Leave to cool on a rack and enjoy while still warm or cold with a cup of tea. If you prefer, Eccles cakes also go really well served with a wedge of hard, tangy British cheese such as Lancashire or cheddar.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wtqrqw1511639627.jpg",
        "strTags": "Snack,Treat",
        "strYoutube": "https://www.youtube.com/watch?v=xV0QCJ0GD5w",
        "strIngredient": [
            "Butter",
            "Plain Flour",
            "Lemon",
            "Butter",
            "Currants",
            "Mixed Peel",
            "Muscovado Sugar",
            "Cinnamon",
            "Ginger",
            "Allspice",
            "Lemon",
            "Eggs",
            "Sugar"
        ]
    },
    {
        "idMeal": 53,
        "price":94,
        "rating":1,
        "strMeal": "Eton Mess",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Purée half the strawberries in a blender. Chop the remaining strawberries, reserving four for decoration.\r\nWhip the double cream until stiff peaks form, then fold in the strawberry purée and crushed meringue. Fold in the chopped strawberries and ginger cordial, if using.\r\nSpoon equal amounts of the mixture into four cold wine glasses. Serve garnished with the remaining strawberries and a sprig of mint.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/uuxwvq1483907861.jpg",
        "strTags": "Dairy,Fruity,Desert,Treat,Speciality",
        "strYoutube": "https://www.youtube.com/watch?v=43WgiNq54L8",
        "strIngredient": [
            "strawberries",
            "double cream",
            "meringue nests",
            "ginger cordial"
        ]
    },
    {
        "idMeal": 54,
        "price":120,
        "rating":3.4,
        "strMeal": "Honey Yogurt Cheesecake",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "Greek",
        "strInstructions": "Heat oven to 160C/140C fan/gas 3. Crush the biscuits and most of the almonds inside a plastic food bag using a rolling pin. Mix with the butter, then press into the bottom of a deep, oval, 23cm dish (or something similar in size – a roasting tin, baking dish or cake tin will work). Bake for 10 mins until crisp.\r\n\r\nStir or mash together the yogurt and mascarpone, then whisk in the eggs, one at a time. Stir in the lemon and orange zests, then stir in most of the honey, reserving about 3 tbsp. Spread over the biscuit base, cover loosely with foil and cook for 1 hr. Remove the foil and cook for 15 mins more until lightly golden and the top is firm with just the slightest wobble in the middle. Leave to cool. Can be kept in the fridge for up to 2 days.\r\n\r\nTo serve, scatter with almonds, drizzle over the remaining honey, and hand around fresh fruit to go with it.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/y2irzl1585563479.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=JE8crtueXs8",
        "strIngredient": [
            "Digestive Biscuits",
            "Almonds",
            "Butter",
            "Greek Yogurt",
            "Mascarpone",
            "Eggs",
            "Lemon",
            "Honey"
        ]
    },
    {
        "idMeal": 55,
        "price":390,
        "rating":4.8,
        "strMeal": "Hot Chocolate Fudge",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "American",
        "strInstructions": "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.\r\nIn a microwave-safe bowl, combine the dark chocolate chips, heavy cream and half of the sweetened condensed milk. Microwave the dark chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nAdd the vanilla extract to the dark chocolate mixture and stir well until smooth.\r\nTransfer the dark chocolate mixture into the prepared pan and spread into an even layer.\r\nIn a separate bowl, combine the white chocolate chips with the remaining half of the sweetened condensed milk. Microwave the white chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.\r\nEvenly spread the white chocolate mixture on top of dark chocolate layer.\r\nTop the chocolate layers with the Mallow Bits or miniature marshmallows, and gently press them down.\r\nRefrigerate for 4 hours, or until set.\r\nRemove the fudge and wax paper from the pan. Carefully peel all of the wax paper from the fudge.\r\nCut the fudge into bite-sized pieces and serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xrysxr1483568462.jpg",
        "strTags": "Snack,Chocolate",
        "strYoutube": "https://www.youtube.com/watch?v=oJvbsVSblfk",
        "strIngredient": [
            "Chocolate Chips",
            "Heavy Cream",
            "Condensed Milk",
            "Vanilla Extract",
            "White Chocolate Chips",
            "Miniature Marshmallows"
        ]
    },
    {
        "idMeal": 56,
        "price":570,
        "rating":5,
        "strMeal": "Jam Roly-Poly",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "British",
        "strInstructions": "Put a deep roasting tin onto the bottom shelf of the oven, and make sure that there’s another shelf directly above it. Pull the roasting tin out on its shelf, fill two-thirds with boiling water from the kettle, then carefully slide it back in. Heat oven to 180C/160C fan/gas 4. Tear off a large sheet of foil and greaseproof paper (about 30 x 40cm). Sit the greaseproof on top of the foil and butter it.\r\nTip butter, flour and vanilla seeds into a food processor; pulse until the butter has disappeared. Tip into a mixing bowl. Stir through the suet, pour in the milk and work together with a cutlery knife until you get a sticky dough. You may need a drop more milk, depending on your flour.\r\nTip the dough out onto a floured surface, quickly pat together to smooth, then roll out to a square roughly 25 x 25cm. Spread the jam all over, leaving a gap along one edge, then roll up from the opposite edge. Pinch the jam-free edge into the dough where it meets, and pinch the ends roughly, too. Carefully lift onto the greased paper, join-side down (you might find a flat baking sheet helpful for this), loosely bring up the paper and foil around it, then scrunch together along the edges and ends to seal. The roly-poly will puff quite a bit during cooking so don’t wrap it tightly. Lift the parcel directly onto the rack above the tin and cook for 1 hr.\r\nLet the pudding sit for 5 mins before unwrapping, then carefully open the foil and paper, and thickly slice to serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/ysqupp1511640538.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=5ZYWVQ8imVA",
        "strIngredient": [
            "Butter",
            "Self-raising Flour",
            "Vanilla",
            "Suet",
            "Milk",
            "Raspberry Jam",
            "Custard"
        ]
    },
    {
        "idMeal": 57,
        "price":190,
        "rating":2.5,
        "strMeal": "Key Lime Pie",
        "strDrinkAlternate": null,
        "strCategory": "Dessert",
        "strArea": "American",
        "strInstructions": "Heat the oven to 160C/fan 140C/gas 3. Whizz the biscuits to crumbs in a food processor (or put in a strong plastic bag and bash with a rolling pin). Mix with the melted butter and press into the base and up the sides of a 22cm loose-based tart tin. Bake in the oven for 10 minutes. Remove and cool.\r\nPut the egg yolks in a large bowl and whisk for a minute with electric beaters. Add the condensed milk and whisk for 3 minutes then add the zest and juice and whisk again for 3 minutes. Pour the filling into the cooled base then put back in the oven for 15 minutes. Cool then chill for at least 3 hours or overnight if you like.\r\nWhen you are ready to serve, carefully remove the pie from the tin and put on a serving plate. To decorate, softly whip together the cream and icing sugar. Dollop or pipe the cream onto the top of the pie and finish with extra lime zest.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/qpqtuu1511386216.jpg",
        "strTags": "Cake,Pie,Desert,Fruity,Sour",
        "strYoutube": "https://www.youtube.com/watch?v=q4Rz7tUkX9A",
        "strIngredient": [
            "Digestive Biscuits",
            "Butter",
            "Condensed Milk",
            "Egg Yolks",
            "Lime",
            "Double Cream",
            "Icing Sugar",
            "Lime"
        ]
    },
    {
        "idMeal": 58,
        "price":70,
        "rating":3.5,
        "strMeal": "Chilli prawn linguine",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "Italian",
        "strInstructions": "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.\r\n\r\nCook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.\r\n\r\nMeanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.\r\n\r\nAdd the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.\r\n\r\nServe with salad leaves drizzled with the lime dressing, and warm crusty bread.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=SC17Mc70Db0",
        "strIngredient": [
            "Linguine Pasta",
            "Sugar Snap Peas",
            "Olive Oil",
            "Garlic Clove",
            "Red Chilli",
            "King Prawns",
            "Cherry Tomatoes",
            "Basil Leaves",
            "Lettuce",
            "Bread",
            "Fromage Frais",
            "Lime",
            "Caster Sugar"
        ]
    },
    {
        "idMeal": 59,
        "price":90,
        "rating":2,
        "strMeal": "Fettuccine Alfredo",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "Italian",
        "strInstructions": "Cook pasta according to package instructions in a large pot of boiling water and salt. Add heavy cream and butter to a large skillet over medium heat until the cream bubbles and the butter melts. Whisk in parmesan and add seasoning (salt and black pepper). Let the sauce thicken slightly and then add the pasta and toss until coated in sauce. Garnish with parsley, and it's ready.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/0jv5gx1661040802.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=LPPcNPdq_j4",
        "strIngredient": [
            "Fettuccine",
            "Heavy Cream",
            "Butter",
            "Parmesan",
            "Parsley",
            "Black Pepper"
        ]
    },
    {
        "idMeal": 60,
        "price":30,
        "rating":4.5,
        "strMeal": "Fettucine alfredo",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "Italian",
        "strInstructions": "In a medium saucepan, stir the clotted cream, butter and cornflour over a low-ish heat and bring to a low simmer. Turn off the heat and keep warm.\r\nMeanwhile, put the cheese and nutmeg in a small bowl and add a good grinding of black pepper, then stir everything together (don’t add any salt at this stage).\r\nPut the pasta in another pan with 2 tsp salt, pour over some boiling water and cook following pack instructions (usually 3-4 mins). When cooked, scoop some of the cooking water into a heatproof jug or mug and drain the pasta, but not too thoroughly.\r\nAdd the pasta to the pan with the clotted cream mixture, then sprinkle over the cheese and gently fold everything together over a low heat using a rubber spatula. When combined, splash in 3 tbsp of the cooking water. At first, the pasta will look wet and sloppy: keep stirring until the water is absorbed and the sauce is glossy. Check the seasoning before transferring to heated bowls. Sprinkle over some chives or parsley, then serve immediately.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/uquqtu1511178042.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=FLEnwZvGzOE",
        "strIngredient": [
            "Clotted Cream",
            "Butter",
            "Corn Flour",
            "Parmesan Cheese",
            "Nutmeg",
            "Fettuccine",
            "Parsley"
        ]
    },
    {
        "idMeal": 61,
        "price":90,
        "rating":4.5,
        "strMeal": "Grilled Mac and Cheese Sandwich",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "American",
        "strInstructions": "Make the mac and cheese\r\n\r\n1. Bring a medium saucepan of generously salted water (you want it to taste like seawater) to a boil. Add the pasta and cook, stirring occasionally, until al dente, 8 to 10 minutes, or according to the package directions. The pasta should be tender but still chewy.\r\n2. While the pasta is cooking, in a small bowl, whisk together the flour, mustard powder, garlic powder, salt, black pepper, and cayenne pepper.\r\n3. Drain the pasta in a colander. Place the empty pasta pan (no need to wash it) over low heat and add the butter. When the butter has melted, whisk in the flour mixture and continue to cook, whisking frequently, until the mixture is beginning to brown and has a pleasant, nutty aroma, about 1 minute. Watch carefully so it does not scorch on the bottom of the pan.\r\n4. Slowly whisk the milk and cream into the flour mixture until everything is really well combined. Cook, whisking constantly, until the sauce is heated through and just begins to thicken, about 2 minutes. Remove from the heat. Gradually add the cheese while stirring constantly with a wooden spoon or silicone spatula and keep stirring until the cheese has melted into the sauce. Then stir in the drained cooked pasta.\r\n5. Line a 9-by-13-inch (23-by-33-centimeter) rimmed baking sheet with parchment paper or aluminum foil. Coat the paper or foil with nonstick cooking spray or slick it with butter. Pour the warm mac and cheese onto the prepared baking sheet and spread it evenly with a spatula. Coat another piece of parchment paper with cooking spray or butter and place it, oiled or buttered side down, directly on the surface of the mac and cheese. Refrigerate until cool and firm, about 1 hour.\r\n\r\nMake the grilled cheese\r\n6. Heat a large cast-iron or nonstick skillet over medium-low heat.\r\n7. In a small bowl, stir together the 4 tablespoons (55 grams) butter and garlic powder until well blended.\r\n8. Remove the mac and cheese from the refrigerator and peel off the top layer of parchment paper. Carefully cut into 8 equal pieces. Each piece will make 1 grilled mac and cheese sandwich. (You can stash each individual portion in a double layer of resealable plastic bags and refrigerate for up to 3 days or freeze it for up to 1 month.)\r\n9. Spread 3/4 teaspoon garlic butter on one side of each bread slice. Place half of the slices, buttered-side down, on a clean cutting board. Top each with one slice of Cheddar, then 1 piece of the mac and cheese. (Transfer from the baking sheet by scooting your hand or a spatula under each piece of mac and cheese and then flipping it over onto a sandwich.) Place 1 slice of Jack on top of each. Finish with the remaining bread slices, buttered-side up.\r\n10. Using a wide spatula, place as many sandwiches in the pan as will fit without crowding it. Cover and cook until the bottoms are nicely browned, about 4 minutes. Turn and cook until the second sides are browned, the cheese is melted, and the mac and cheese is heated through, about 4 minutes more.\r\n11. Repeat with the remaining ingredients. Cut the sandwiches in half, if desired, and serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xutquv1505330523.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=PYq31xLj-DY",
        "strIngredient": [
            "Macaroni",
            "Plain Flour",
            "Mustard Powder",
            "Garlic powder",
            "Kosher salt",
            "Whole Milk",
            "Heavy Cream",
            "Monterey Jack Cheese",
            "Butter",
            "garlic powder",
            "Bread",
            "Cheddar Cheese",
            "Colby Jack Cheese",
            "Butter"
        ]
    },
    {
        "idMeal": 62,
        "price":30,
        "rating":3,
        "strMeal": "Lasagna Sandwiches",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "American",
        "strInstructions": "1. In a small bowl, combine the first four ingredients; spread on four slices of bread. Layer with bacon, tomato and cheese; top with remaining bread.\r\n\r\n2. In a large skillet or griddle, melt 2 tablespoons butter. Toast sandwiches until lightly browned on both sides and cheese is melted, adding butter if necessary.\r\n\r\nNutrition Facts\r\n1 sandwich: 445 calories, 24g fat (12g saturated fat), 66mg cholesterol, 1094mg sodium, 35g carbohydrate (3g sugars, 2g fiber), 21g protein.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xr0n4r1576788363.jpg",
        "strTags": "Sandwich",
        "strYoutube": "",
        "strIngredient": [
            "Sour Cream",
            "Chopped Onion",
            "Dried Oregano",
            "Salt",
            "Bread",
            "Bacon",
            "Tomato",
            "Mozzarella",
            "Butter"
        ]
    },
    {
        "idMeal": 63,
        "price":200,
        "rating":4,
        "strMeal": "Lasagne",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "Italian",
        "strInstructions": "Heat the oil in a large saucepan. Use kitchen scissors to snip the bacon into small pieces, or use a sharp knife to chop it on a chopping board. Add the bacon to the pan and cook for just a few mins until starting to turn golden. Add the onion, celery and carrot, and cook over a medium heat for 5 mins, stirring occasionally, until softened.\r\nAdd the garlic and cook for 1 min, then tip in the mince and cook, stirring and breaking it up with a wooden spoon, for about 6 mins until browned all over.\r\nStir in the tomato purée and cook for 1 min, mixing in well with the beef and vegetables. Tip in the chopped tomatoes. Fill each can half full with water to rinse out any tomatoes left in the can, and add to the pan. Add the honey and season to taste. Simmer for 20 mins.\r\nHeat oven to 200C/180C fan/gas 6. To assemble the lasagne, ladle a little of the ragu sauce into the bottom of the roasting tin or casserole dish, spreading the sauce all over the base. Place 2 sheets of lasagne on top of the sauce overlapping to make it fit, then repeat with more sauce and another layer of pasta. Repeat with a further 2 layers of sauce and pasta, finishing with a layer of pasta.\r\nPut the crème fraîche in a bowl and mix with 2 tbsp water to loosen it and make a smooth pourable sauce. Pour this over the top of the pasta, then top with the mozzarella. Sprinkle Parmesan over the top and bake for 25–30 mins until golden and bubbling. Serve scattered with basil, if you like.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=gfhfsBPt46s",
        "strIngredient": [
            "Olive Oil",
            "Bacon",
            "Onion",
            "Celery",
            "Carrots",
            "Garlic",
            "Minced Beef",
            "Tomato Puree",
            "Chopped Tomatoes",
            "Honey",
            "Lasagne Sheets",
            "Creme Fraiche",
            "Mozzarella Balls",
            "Parmesan Cheese"
        ]
    },
    {
        "idMeal": 64,
        "price":20,
        "rating":3.5,
        "strMeal": "Pilchard puttanesca",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "Italian",
        "strInstructions": "Cook the pasta following pack instructions. Heat the oil in a non-stick frying pan and cook the onion, garlic and chilli for 3-4 mins to soften. Stir in the tomato purée and cook for 1 min, then add the pilchards with their sauce. Cook, breaking up the fish with a wooden spoon, then add the olives and continue to cook for a few more mins.\r\n\r\nDrain the pasta and add to the pan with 2-3 tbsp of the cooking water. Toss everything together well, then divide between plates and serve, scattered with Parmesan.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/vvtvtr1511180578.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=wqZzLAPmr9k",
        "strIngredient": [
            "Spaghetti",
            "Olive Oil",
            "Onion",
            "Garlic",
            "Red Chilli",
            "Tomato Puree",
            "Pilchards",
            "Black Olives"
        ]
    },
    {
        "idMeal": 65,
        "price":180,
        "rating":2.5,
        "strMeal": "Spaghetti alla Carbonara",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "Italian",
        "strInstructions": "STEP 1\r\nPut a large saucepan of water on to boil.\r\n\r\nSTEP 2\r\nFinely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.\r\n\r\nSTEP 3\r\nBeat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.\r\n\r\nSTEP 4\r\nAdd 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).\r\n\r\nSTEP 5\r\nSquash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.\r\n\r\nSTEP 6\r\nWhile the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.\r\n\r\nSTEP 7\r\nLeave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.\r\n\r\nSTEP 8\r\nKeep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet.\r\n\r\nSTEP 9\r\nMix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.\r\n\r\nSTEP 10\r\nTake the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated.\r\n\r\nSTEP 11\r\nAdd extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed.\r\n\r\nSTEP 12\r\nUse a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/llcbn01574260722.jpg",
        "strTags": "Pasta,BBQ,Breakfast",
        "strYoutube": "https://www.youtube.com/watch?v=_T6jkRvhlkk",
        "strIngredient": [
            "Spaghetti",
            "Egg Yolks",
            "Salt",
            "Bacon",
            "Pecorino"
        ]
    },
    {
        "idMeal": 66,
        "price":90,
        "rating":4.8,
        "strMeal": "Venetian Duck Ragu",
        "strDrinkAlternate": null,
        "strCategory": "Pasta",
        "strArea": "Italian",
        "strInstructions": "Heat the oil in a large pan. Add the duck legs and brown on all sides for about 10 mins. Remove to a plate and set aside. Add the onions to the pan and cook for 5 mins until softened. Add the garlic and cook for a further 1 min, then stir in the cinnamon and flour and cook for a further min. Return the duck to the pan, add the wine, tomatoes, stock, herbs, sugar and seasoning. Bring to a simmer, then lower the heat, cover with a lid and cook for 2 hrs, stirring every now and then.\r\nCarefully lift the duck legs out of the sauce and place on a plate – they will be very tender so try not to lose any of the meat. Pull off and discard the fat, then shred the meat with 2 forks and discard the bones. Add the meat back to the sauce with the milk and simmer, uncovered, for a further 10-15 mins while you cook the pasta.\r\nCook the pasta following pack instructions, then drain, reserving a cup of the pasta water, and add the pasta to the ragu. Stir to coat all the pasta in the sauce and cook for 1 min more, adding a splash of cooking liquid if it looks dry. Serve with grated Parmesan, if you like.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/qvrwpt1511181864.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=oWQDVgjB_Lw",
        "strIngredient": [
            "Olive Oil",
            "Duck Legs",
            "Onions",
            "Garlic",
            "Cinnamon",
            "Plain Flour",
            "Red Wine",
            "Chopped Tomatoes",
            "Rosemary",
            "Bay Leaves",
            "Sugar",
            "Milk",
            "Paccheri Pasta",
            "Parmesan Cheese"
        ]
    },
    {
        "idMeal": 67,
        "price":60,
        "rating":5,
        "strMeal": "Baingan Bharta",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Indian",
        "strInstructions": "Rinse the baingan (eggplant or aubergine) in water. Pat dry with a kitchen napkin. Apply some oil all over and\r\nkeep it for roasting on an open flame. You can also grill the baingan or roast in the oven. But then you won't get\r\nthe smoky flavor of the baingan. Keep the eggplant turning after a 2 to 3 minutes on the flame, so that its evenly\r\ncooked. You could also embed some garlic cloves in the baingan and then roast it.\r\n2. Roast the aubergine till its completely cooked and tender. With a knife check the doneness. The knife should slid\r\neasily in aubergines without any resistance. Remove the baingan and immerse in a bowl of water till it cools\r\ndown.\r\n3. You can also do the dhungar technique of infusing charcoal smoky flavor in the baingan. This is an optional step.\r\nUse natural charcoal for this method. Heat a small piece of charcoal on flame till it becomes smoking hot and red.\r\n4. Make small cuts on the baingan with a knife. Place the red hot charcoal in the same plate where the roasted\r\naubergine is kept. Add a few drops of oil on the charcoal. The charcoal would begin to smoke.\r\n5. As soon as smoke begins to release from the charcoal, cover the entire plate tightly with a large bowl. Allow the\r\ncharcoal smoke to get infused for 1 to 2 minutes. The more you do, the more smoky the baingan bharta will\r\nbecome. I just keep for a minute. Alternatively, you can also do this dhungar method once the baingan bharta is\r\ncooked, just like the way we do for Dal Tadka.\r\n6. Peel the skin from the roasted and smoked eggplant.\r\n7. Chop the cooked eggplant finely or you can even mash it.\r\n8. In a kadai or pan, heat oil. Then add finely chopped onions and garlic.\r\n9. Saute the onions till translucent. Don't brown them.\r\n10. Add chopped green chilies and saute for a minute.\r\n11. Add the chopped tomatoes and mix it well.\r\n12. Bhuno (saute) the tomatoes till the oil starts separating from the mixture.\r\n13. Now add the red chili powder. Stir and mix well.\r\n14. Add the chopped cooked baingan.\r\n15. Stir and mix the chopped baingan very well with the onion­tomato masala mixture.\r\n16. Season with salt. Stir and saute for some more 4 to 5 minutes more.\r\n17. Finally stir in the coriander leaves with the baingan bharta or garnish it with them. Serve Baingan Bharta with\r\nphulkas, rotis or chapatis. It goes well even with bread, toasted or grilled bread and plain rice or jeera rice.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/urtpqw1487341253.jpg",
        "strTags": "Spicy,Bun,Calorific",
        "strYoutube": "https://www.youtube.com/watch?v=-84Zz2EP4h4",
        "strIngredient": [
            "Aubergine",
            "Onion",
            "Tomatoes",
            "Garlic",
            "Green Chili",
            "Red Chili Powder",
            "Oil",
            "Coriander Leaves",
            "salt"
        ]
    },
    {
        "idMeal": 68,
        "price":90,
        "rating":3.5,
        "strMeal": "Chickpea Fajitas",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Mexican",
        "strInstructions": "Heat oven to 200C/180C fan/gas 6 and line a baking tray with foil. Drain the chickpeas, pat dry and tip onto the prepared baking tray. Add the oil and paprika, toss to coat, then roast for 20-25 mins until browned and crisp, shaking halfway through cooking.\r\n\r\nMeanwhile, put the tomatoes and onion in a small bowl with the vinegar and set aside to pickle. Put the avocado in another bowl and mash with a fork, leaving some larger chunks. Stir in the lime juice and season well. Mix the soured cream with the harissa and set aside until ready to serve.\r\n\r\nHeat a griddle pan until nearly smoking. Add the tortillas , one at a time, charring each side until hot with griddle lines. \r\n\r\nPut everything on the table and build the fajitas : spread a little of the harissa cream over the tortilla, top with roasted chickpeas, guacamole, pickled salsa and coriander, if you like. Serve with the lime wedges for squeezing over.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/tvtxpq1511464705.jpg",
        "strTags": "Vegetarian",
        "strYoutube": "https://www.youtube.com/watch?v=LGY3V7EGpT0",
        "strIngredient": [
            "Chickpeas",
            "Olive Oil",
            "Paprika",
            "Tomatoes",
            "Red Onions",
            "Red Wine Vinegar",
            "Avocado",
            "Lime",
            "Lime",
            "Sour Cream",
            "Harissa Spice",
            "Corn Tortillas",
            "Coriander"
        ]
    },
    {
        "idMeal": 69,
        "price":80,
        "rating":2.5,
        "strMeal": "Dal fry",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Indian",
        "strInstructions": "Wash and soak toor dal in approx. 3 cups of water, for at least one hours. Dal will be double in volume after soaking. Drain the water.\r\nCook dal with 2-1/2 cups water and add salt, turmeric, on medium high heat, until soft in texture (approximately 30 mins) it should be like thick soup.\r\nIn a frying pan, heat the ghee. Add cumin seeds, and mustard seeds. After the seeds crack, add bay leaves, green chili, ginger and chili powder. Stir for a few seconds.\r\nAdd tomatoes, salt and sugar stir and cook until tomatoes are tender and mushy.\r\nAdd cilantro and garam masala cook for about one minute.\r\nPour the seasoning over dal mix it well and cook for another minute.\r\nServe with Naan.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wuxrtu1483564410.jpg",
        "strTags": "Curry,Vegetarian,Cake",
        "strYoutube": "https://www.youtube.com/watch?v=J4D855Q9-jg",
        "strIngredient": [
            "Toor dal",
            "Water",
            "Salt",
            "Turmeric",
            "Ghee",
            "Chopped tomatoes",
            "Cumin seeds",
            "Mustard Seeds",
            "Bay Leaf",
            "Green Chili",
            "Ginger",
            "Cilantro",
            "Red Pepper",
            "Salt",
            "Sugar",
            "Garam Masala"
        ]
    },
    {
        "idMeal": 70,
        "price":104,
        "rating":5,
        "strMeal": "Egg Drop Soup",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Chinese",
        "strInstructions": "In a wok add chicken broth and wait for it to boil.\r\nNext add salt, sugar, white pepper, sesame seed oil.\r\nWhen the chicken broth is boiling add the vegetables to the wok.\r\nTo thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.\r\nNext add 1 egg slightly beaten with a knife or fork and add it to the soup slowly and stir for 8 seconds\r\nServe the soup in a bowl and add the green onions on top.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1529446137.jpg",
        "strTags": "Soup,Baking,Calorific",
        "strYoutube": "https://www.youtube.com/watch?v=9XpzHm9QpZg",
        "strIngredient": [
            "Chicken Stock",
            "Salt",
            "Sugar",
            "Pepper",
            "Sesame Seed Oil",
            "Peas",
            "Mushrooms",
            "Cornstarch",
            "Water",
            "Spring Onions"
        ]
    },
    {
        "idMeal": 71,
        "price":55,
        "rating":4.4,
        "strMeal": "Flamiche",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "French",
        "strInstructions": "For the pastry, sift the flour and salt into the bowl of a food processor, add the butter and lard, then whizz together briefly until the mixture looks like fine breadcrumbs. Tip the mixture into a bowl, then stir in the cheese and enough of the water for the mixture to come together. Tip out onto a lightly floured surface and knead briefly until smooth. Roll out thinly and line a 23cm x 4cm loose-?bottomed fluted flan tin. Prick the base with a fork. Chill for 20 minutes.\r\n02.Melt the 75g butter in a saucepan over a low heat, then add the leeks and the salt. Cover and cook for ?10 minutes until soft. Uncover the pan, increase the heat and cook ?for 2 minutes, stirring occasionally, until the liquid has evaporated. Spoon onto a plate and leave to cool.\r\n03.Preheat the oven to 200°C/fan180°C/gas 6. Line the pastry case with baking paper and baking beans or rice and blind bake for 15-20 minutes until the edges are biscuit-coloured. Remove the paper and beans/rice and return the case to the oven for 7-10 minutes until the base is crisp and lightly golden. Remove and set aside. Reduce the oven temperature to 190°C/fan170°C/gas 5.\r\n04.Put the crème fraîche into a bowl with the whole egg, egg yolks and nutmeg. Lightly beat together, then season. Stir in the leeks. Spoon ?the mixture into the tart case and bake for 35-40 minutes until set ?and lightly golden. Remove from ?the oven and leave for 10 minutes. Take out of the tin and serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/wssvvs1511785879.jpg",
        "strTags": "Tart",
        "strYoutube": "https://www.youtube.com/watch?v=vT0q5c880Rg",
        "strIngredient": [
            "Butter",
            "Leek",
            "Salt",
            "Creme Fraiche",
            "Egg",
            "Egg Yolks",
            "Nutmeg",
            "Plain Flour",
            "Salt",
            "Butter",
            "Lard",
            "Cheddar Cheese",
            "Water"
        ]
    },
    {
        "idMeal": 72,
        "price":99,
        "rating":5,
        "strMeal": "Ful Medames",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Egyptian",
        "strInstructions": "As the cooking time varies depending on the quality and age of the beans, it is good to cook them in advance and to reheat them when you are ready to serve. Cook the drained beans in a fresh portion of unsalted water in a large saucepan with the lid on until tender, adding water to keep them covered, and salt when the beans have softened. They take 2–2 1/2 hours of gentle simmering. When the beans are soft, let the liquid reduce. It is usual to take out a ladle or two of the beans and to mash them with some of the cooking liquid, then stir this back into the beans. This is to thicken the sauce.\r\nServe the beans in soup bowls sprinkled with chopped parsley and accompanied by Arab bread.\r\nPass round the dressing ingredients for everyone to help themselves: a bottle of extra-virgin olive oil, the quartered lemons, salt and pepper, a little saucer with the crushed garlic, one with chili-pepper flakes, and one with ground cumin.\r\nThe beans are eaten gently crushed with the fork, so that they absorb the dressing.\r\nOptional Garnishes\r\nPeel hard-boiled eggs—1 per person—to cut up in the bowl with the beans.\r\nTop the beans with a chopped cucumber-and-tomato salad and thinly sliced mild onions or scallions. Otherwise, pass round a good bunch of scallions and quartered tomatoes and cucumbers cut into sticks.\r\nServe with tahina cream sauce (page 65) or salad (page 67), with pickles and sliced onions soaked in vinegar for 30 minutes.\r\nAnother way of serving ful medames is smothered in a garlicky tomato sauce (see page 464).\r\nIn Syria and Lebanon, they eat ful medames with yogurt or feta cheese, olives, and small cucumbers.\r\nVariations\r\nA traditional way of thickening the sauce is to throw a handful of red lentils (1/4 cup) into the water at the start of the cooking.\r\nIn Iraq, large brown beans are used instead of the small Egyptian ones, in a dish called badkila, which is also sold for breakfast in the street.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/lvn2d51598732465.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=ixpCabILuxw",
        "strIngredient": [
            "Broad Beans",
            "Parsley",
            "Olive Oil",
            "Lemons",
            "Garlic Clove",
            "Cumin"
        ]
    },
    {
        "idMeal": 73,
        "price":50,
        "rating":1.5,
        "strMeal": "Gigantes Plaki",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Greek",
        "strInstructions": "Soak the beans overnight in plenty of water. Drain, rinse, then place in a pan covered with water. Bring to the boil, reduce the heat, then simmer for approx 50 mins until slightly tender but not soft. Drain, then set aside.\r\n\r\nHeat oven to 180C/160C fan/gas 4. Heat the olive oil in a large frying pan, tip in the onion and garlic, then cook over a medium heat for 10 mins until softened but not browned. Add the tomato purée, cook for a further min, add remaining ingredients, then simmer for 2-3 mins. Season generously, then stir in the beans. Tip into a large ovenproof dish, then bake for approximately 1 hr, uncovered and without stirring, until the beans are tender. The beans will absorb all the fabulous flavours and the sauce will thicken. Allow to cool, then scatter with parsley and drizzle with a little more olive oil to serve.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/b79r6f1585566277.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=e-2K2iyPASA",
        "strIngredient": [
            "Butter Beans",
            "Olive Oil",
            "Onion",
            "Garlic Clove",
            "Tomato Puree",
            "Tomatoes",
            "Sugar",
            "Dried Oregano",
            "Cinnamon",
            "Chopped Parsley"
        ]
    },
    {
        "idMeal": 74,
        "price":300,
        "rating":2.7,
        "strMeal": "Kafteji",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Tunisian",
        "strInstructions": "Peel potatoes and cut into 5cm cubes.\r\nPour 1-2 cm of olive oil into a large pan and heat up very hot. Fry potatoes until golden brown for 20 minutes, turning from time to time. Place on kitchen paper to drain.\r\nCut the peppers in half and remove seeds. Rub a little olive oil on them and place the cut side down on a baking tray. Place them under the grill. Grill until the skin is dark and bubbly. While the peppers are still hot, put them into a plastic sandwich bag and seal it. Take them out after 15 minutes and remove skins.\r\nIn the meantime, heat more olive oil another pan. Peel the onions and cut into thin rings. Fry for 15 minutes until golden brown, turning them often. Add the Ras el hanout at the end.\r\nCut the pumpkin into 5cm cubes and fry in the same pan you used for the potatoes for 10-15 minutes until it is soft and slightly browned. Place on kitchen paper.\r\nPour the remaining olive oil out of the pan and put all the cooked vegetables into the pan and mix. Whisk eggs and pour them over the vegetables. Put the lid on the pan so that the eggs cook. Put the contents of the pan onto a large chopping board, add salt and pepper and chopped and mix everything with a big knife.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/1bsv1q1560459826.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=-TFf-Zu-xQU",
        "strIngredient": [
            "Potatoes",
            "Olive Oil",
            "Green Pepper",
            "Onions",
            "Ras el hanout",
            "Pumpkin",
            "Eggs",
            "Salt",
            "Pepper"
        ]
    },
    {
        "idMeal": 75,
        "price":40,
        "rating":4.1,
        "strMeal": "Kidney Bean Curry",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Indian",
        "strInstructions": "Heat the oil in a large frying pan over a low-medium heat. Add the onion and a pinch of salt and cook slowly, stirring occasionally, until softened and just starting to colour. Add the garlic, ginger and coriander stalks and cook for a further 2 mins, until fragrant.\r\n\r\nAdd the spices to the pan and cook for another 1 min, by which point everything should smell aromatic. Tip in the chopped tomatoes and kidney beans in their water, then bring to the boil.\r\n\r\nTurn down the heat and simmer for 15 mins until the curry is nice and thick. Season to taste, then serve with the basmati rice and the coriander leaves.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/sywrsu1511463066.jpg",
        "strTags": "Curry",
        "strYoutube": "https://www.youtube.com/watch?v=Tp_PMWvIKzo",
        "strIngredient": [
            "Vegetable Oil",
            "Onion",
            "Garlic",
            "Ginger",
            "Coriander",
            "Cumin",
            "Paprika",
            "Garam Masala",
            "Chopped Tomatoes",
            "Kidney Beans",
            "Basmati Rice"
        ]
    },
    {
        "idMeal": 76,
        "price":300,
        "rating":5,
        "strMeal": "Koshari",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Egyptian",
        "strInstructions": "Cook the lentils. Bring lentils and 4 cups of water to a boil in a medium pot or saucepan over high heat. Reduce the heat to low and cook until lentils are just tender (15-17 minutes). Drain from water and season with a little salt. (Note: when the lentils are ready, they should not be fully cooked. They should be only par-cooked and still have a bite to them as they need to finish cooking with the rice).\r\nNow, for the rice. Drain the rice from its soaking water. Combine the par-cooked lentils and the rice in the saucepan over medium-high heat with 1 tbsp cooking oil, salt, pepper, and coriander. Cook for 3 minutes, stirring regularly. Add warm water to cover the rice and lentil mixture by about 1 1/2 inches (you’ll probably use about 3 cups of water here). Bring to a boil; the water should reduce a bit. Now cover and cook until all the liquid has been absorbed and both the rice and lentils are well cooked through (about 20 minutes).  Keep covered and undisturbed for 5 minutes or so.\r\nNow make the pasta. While the rice and lentils are cooking, make the pasta according to package instructions by adding the elbow pasta to boiling water with a dash of salt and a little oil. Cook until the pasta is al dente. Drain.\r\nCover the chickpeas and warm in the microwave briefly before serving.\r\n\r\nMake the crispy onion topping. \r\n\r\nSprinkle the onion rings with salt, then toss them in the flour to coat. Shake off excess flour.\r\nIn a large skillet, heat the cooking oil over medium-high heat, cook the onion rings, stirring often, until they turn a nice caramelized brown. Onions must be crispy, but not burned (15-20 minutes).",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/4er7mj1598733193.jpg",
        "strTags": null,
        "strYoutube": "https://www.youtube.com/watch?v=y0d2ZMZBW4Y",
        "strIngredient": [
            "Brown Lentils",
            "Rice",
            "Coriander",
            "Macaroni",
            "Chickpeas",
            "Onion",
            "Salt",
            "Vegetable Oil"
        ]
    },
    {
        "idMeal": 77,
        "price":120,
        "rating":4.9,
        "strMeal": "Leblebi Soup",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Tunisian",
        "strInstructions": "Heat the oil in a large pot. Add the onion and cook until translucent.\r\nDrain the soaked chickpeas and add them to the pot together with the vegetable stock. Bring to the boil, then reduce the heat and cover. Simmer for 30 minutes.\r\nIn the meantime toast the cumin in a small ungreased frying pan, then grind them in a mortar. Add the garlic and salt and pound to a fine paste.\r\nAdd the paste and the harissa to the soup and simmer until the chickpeas are tender, about 30 minutes.\r\nSeason to taste with salt, pepper and lemon juice and serve hot.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/x2fw9e1560460636.jpg",
        "strTags": "Soup",
        "strYoutube": "https://www.youtube.com/watch?v=BgRifcCwinY",
        "strIngredient": [
            "Olive Oil",
            "Onion",
            "Chickpeas",
            "Vegetable Stock",
            "Cumin",
            "Garlic",
            "Salt",
            "Harissa Spice",
            "Pepper",
            "Lime"
        ]
    },
    {
        "idMeal": 78,
        "price":30,
        "rating":5,
        "strMeal": "Matar Paneer",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Indian",
        "strInstructions": "Heat the oil in a frying pan over high heat until it’s shimmering hot. Add the paneer, then turn the heat down a little. Fry until it starts to brown at the edges, then turn it over and brown on each side – the paneer will brown faster than you think, so don’t walk away. Remove the paneer from the pan and drain on kitchen paper.\r\nPut the ginger, cumin, turmeric, ground coriander and chilli in the pan, and fry everything for 1 min. Add the tomatoes, mashing them with the back of a spoon and simmer everything for 5 mins until the sauce smells fragrant. Add a splash of water if it’s too thick. Season well. Add the peas and simmer for a further 2 mins, then stir in the paneer and sprinkle over the garam masala. Divide between two bowls, top with coriander leaves and serve with naan bread, roti or rice.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xxpqsy1511452222.jpg",
        "strTags": "Curry,Vegetarian",
        "strYoutube": "https://www.youtube.com/watch?v=wlseYNqwLNs",
        "strIngredient": [
            "Sunflower Oil",
            "Paneer",
            "Ginger",
            "Cumin",
            "Turmeric",
            "Coriander",
            "Green Chilli",
            "Tomato",
            "Peas",
            "Garam Masala",
            "Coriander",
            "Naan Bread"
        ]
    },
    {
        "idMeal": 79,
        "price":230,
        "rating":4.3,
        "strMeal": "Matar Paneer",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "Indian",
        "strInstructions": "Heat the oil in a frying pan over high heat until it’s shimmering hot. Add the paneer, then turn the heat down a little. Fry until it starts to brown at the edges, then turn it over and brown on each side – the paneer will brown faster than you think, so don’t walk away. Remove the paneer from the pan and drain on kitchen paper.\r\nPut the ginger, cumin, turmeric, ground coriander and chilli in the pan, and fry everything for 1 min. Add the tomatoes, mashing them with the back of a spoon and simmer everything for 5 mins until the sauce smells fragrant. Add a splash of water if it’s too thick. Season well. Add the peas and simmer for a further 2 mins, then stir in the paneer and sprinkle over the garam masala. Divide between two bowls, top with coriander leaves and serve with naan bread, roti or rice.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/xxpqsy1511452222.jpg",
        "strTags": "Curry,Vegetarian",
        "strYoutube": "https://www.youtube.com/watch?v=wlseYNqwLNs",
        "strIngredient": [
            "Sunflower Oil",
            "Paneer",
            "Ginger",
            "Cumin",
            "Turmeric",
            "Coriander",
            "Green Chilli",
            "Tomato",
            "Peas",
            "Garam Masala",
            "Coriander",
            "Naan Bread"
        ]
    },
    {
        "idMeal": 80,
        "price":90,
        "rating":3.5,
        "strMeal": "Mushroom & Chestnut Rotolo",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "British",
        "strInstructions": "Soak the dried mushrooms in 350ml boiling water and set aside until needed. Blitz ¾ of the chestnuts with 150ml water until creamy. Roughly chop the remaining chestnuts.\r\nHeat 2 tbsp olive oil in a large non-stick frying pan. Fry the shallots with a pinch of salt until softened, then add the garlic, chopped chestnuts and rosemary, and fry for 2 mins more. Add the wild mushrooms, 2 tbsp oil and some seasoning. Cook for 3 mins until they begin to soften. Drain and roughly chop the dried mushrooms (reserve the soaking liquid), then add those too, along with the soy sauce, and fry for 2 mins more.\r\nWhisk the wine, reserved mushroom liquid and chestnut cream together to create a sauce. Season, then add half to the mushroom mixture in the pan and cook for 1 min until the sauce becomes glossy. Remove and discard the rosemary sprigs, then set the mixture aside.\r\nHeat oven to 180C/160C fan/gas 4. Bring a large pan of salted water to the boil and get a large bowl of ice water ready. Drop the lasagne sheets into the boiling water for 2 mins or until pliable and a little cooked, then immediately plunge them into the cold water. Using your fingers, carefully separate the sheets and transfer to a clean tea towel. Spread a good spoonful of the sauce on the bottom two thirds of each sheet, then, rolling away from yourself, roll up the shorter ends. Cut each roll in half, then position the rolls of pasta cut-side up in a pie dish that you are happy to serve from at the table. If you have any mushroom sauce remaining after you’ve rolled up all the sheets, simply push it into some of the exposed rolls of pasta.\r\nPour the rest of the sauce over the top of the pasta, then bake for 10 mins or until the pasta no longer has any resistance when tested with a skewer.\r\nMeanwhile, put the breadcrumbs, the last 2 tbsp olive oil, sage leaves and some seasoning in a bowl, and toss everything together. Scatter the rotolo with the crumbs and sage, then bake for another 10 mins, until the top is golden and the sage leaves are crispy. Leave to cool for 10 mins to allow the pasta to absorb the sauce, then drizzle with a little truffle oil, if you like, before taking your dish to the table.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/ssyqwr1511451678.jpg",
        "strTags": "Vegetarian,Nutty",
        "strYoutube": "https://www.youtube.com/watch?v=GNN7_ZSJ5YE",
        "strIngredient": [
            "Mushrooms",
            "Chestnuts",
            "Challots",
            "Garlic",
            "Rosemary",
            "Wild Mushrooms",
            "Soy Sauce",
            "White Wine",
            "Lasagne Sheets",
            "Breadcrumbs",
            "Sage",
            "Truffle Oil"
        ]
    },
    {
        "idMeal": 81,
         "price":40,
        "rating":4.5,
        "strMeal": "Provençal Omelette Cake",
        "strDrinkAlternate": null,
        "strCategory": "Vegetarian",
        "strArea": "French",
        "strInstructions": "Break the eggs into two bowls, five in each. Whisk lightly and season with salt and pepper. Heat the oil in a pan, add the courgettes and spring onions, then fry gently for about 10 mins until softened. Cool, then stir into one bowl of eggs with a little salt and pepper. Add the roasted peppers to the other bowl of eggs with the garlic, chilli, salt and pepper.\r\nHeat a little oil in a 20-23cm frying pan, preferably non-stick. Pour the eggs with courgette into a measuring jug, then pourabout one-third of the mixture into the pan, swirling it to cover the base of the pan. Cook until the egg is set and lightly browned underneath, then cover the pan with a plate and invert the omelette onto it. Slide it back into the pan to cook the other side. Repeat with the remaining mix to make two more omelettes, adding a little oil to the pan each time. Stack the omelettes onto a plate. Make three omelettes in the same way with the red pepper mixture, then stack them on a separate plate.\r\nNow make the filling. Beat the cheese to soften it, then beat in the milk to make a spreadable consistency. Stir in the herbs, salt and pepper. Line a deep, 20-23cm round cake tin with cling film (use a tin the same size as the frying pan). Select the best red pepper omelette and place in the tin, prettiest side down. Spread with a thin layer of cheese filling, then cover with a courgette omelette. Repeat, alternating the layers, until all the omelettes and filling are in the tin, finishing with an omelette. Flip the cling film over the omelette, then chill for up to 24 hrs.\r\nTo serve, invert the omelette cake onto a serving plate and peel off the cling film. Pile rocket on the top and scatter over the cheese, a drizzle of olive oil and a little freshly ground black pepper. Serve cut into wedges.",
        "strMealThumb": "https://www.themealdb.com/images/media/meals/qwtrtp1511799242.jpg",
        "strTags": "Egg",
        "strYoutube": "https://www.youtube.com/watch?v=B7isFo2uP2k",
        "strIngredient": [
            "Eggs",
            "Olive Oil",
            "Courgettes",
            "Spring Onions",
            "Red Pepper",
            "Garlic Clove",
            "Red Chilli",
            "Cream Cheese",
            "Milk",
            "Chives",
            "Basil",
            "Rocket",
            "Parmesan"
        ]
    }
]